[Survived] StringLiteral
components/ui/forms/LoginForm.js:21:21
             .email("Please enter a valid email address")
             .required("Please enter your email address"),
         password: Yup.string()
-            .min(6, "min. 6 characters")
+            .min(6, "")
             .required("Please enter your password")
     })

[Killed] StringLiteral
components/ui/forms/LoginForm.js:28:41
     return (
         <div>
             <Formik
-                initialValues={{ email: '', password: '' }}
+                initialValues={{ email: "Stryker was here!", password: '' }}
                 validationSchema={validationSchema}
                 onSubmit={(values, { setSubmitting }) => {

[Killed] ObjectLiteral
components/ui/forms/LoginForm.js:28:32
     return (
         <div>
             <Formik
-                initialValues={{ email: '', password: '' }}
+                initialValues={{}}
                 validationSchema={validationSchema}
                 onSubmit={(values, { setSubmitting }) => {

[Survived] BlockStatement
components/ui/forms/LoginForm.js:30:58
             <Formik
                 initialValues={{ email: '', password: '' }}
                 validationSchema={validationSchema}
-                onSubmit={(values, { setSubmitting }) => {
-                    console.log(values)
-                    setSubmitting(true);
-                    requests.post(
-                        `${process.env.REACT_APP_ENDPOINT}/account/login`,
-                        values
-                    ).then(response =>
-                        window.location.href = "/"
-                    ).catch(err => {
-                        setSubmitting(false);
-                        setSubmitError(err.message);
-                    })
-                }}
+                onSubmit={(values, { setSubmitting }) => {}}
 
                 render={({

[Survived] StringLiteral
components/ui/forms/LoginForm.js:34:25
                     console.log(values)
                     setSubmitting(true);
                     requests.post(
-                        `${process.env.REACT_APP_ENDPOINT}/account/login`,
+                        "",
                         values
                     ).then(response =>

[Survived] ArrowFunction
components/ui/forms/LoginForm.js:36:28
                     requests.post(
                         `${process.env.REACT_APP_ENDPOINT}/account/login`,
                         values
-                    ).then(response =>
-                        window.location.href = "/"
+                    ).then(() => undefined
                     ).catch(err => {
                         setSubmitting(false);

[Survived] BlockStatement
components/ui/forms/LoginForm.js:38:36
                         values
                     ).then(response =>
                         window.location.href = "/"
-                    ).catch(err => {
-                        setSubmitting(false);
-                        setSubmitError(err.message);
-                    })
+                    ).catch(err => {})
                 }}
 

[Survived] LogicalOperator
components/ui/forms/LoginForm.js:80:40
                                 onBlur={handleBlur}
                                 value={values.password}
                                 margin='normal'
-                                error={errors.password && touched.password}
+                                error={errors.password || touched.password}
                                 helperText={
                                     errors.password && touched.password ?

[Killed] ConditionalExpression
components/ui/forms/LoginForm.js:99:43
                                 className={formClasses.submit}
                                 type="submit"
                                 margin='normal'
-                                disabled={isSubmitting || !isValid}
+                                disabled={false}
                             >
                                 Log in

[Killed] LogicalOperator
components/ui/forms/LoginForm.js:99:43
                                 className={formClasses.submit}
                                 type="submit"
                                 margin='normal'
-                                disabled={isSubmitting || !isValid}
+                                disabled={isSubmitting && !isValid}
                             >
                                 Log in
