[Killed] BlockStatement
sk8m8/sk8m8/src/App.js:15:16
 import MainNav from './components/ui/nav/MainNav';
 
 
-function App() {
-  return (
-    <Router>
-      <MuiThemeProvider theme={standard}>
-        <Switch>
-
-          <Route path="/login" component={LoginScreen} />
-          <Route path="/signup" component={SignupScreen} />
-
-          <PrivateRoute path="/" exact component={HomeScreen} />
-          <PrivateRoute path="/trickspot" component={MapScreen} />
-          <PrivateRoute path="/people" component={PeopleScreen} />
-
-        </Switch>
-        <MainNav />
-      </MuiThemeProvider>
-    </Router>
-  );
-}
+function App() {}
 
 export default App;
