[Survived] BlockStatement
src/components/account/UserCard.js:21:21
         status: ''
     })
 
-    useEffect(() => {
-        // Get location, add to queryurl
-        props.requests.get(`
-            ${process.env.REACT_APP_ENDPOINT}
-            /Account/Details
-        `).then(data => 
-            updateUserDetails(data)
-        ).catch(err =>
-            updateUserDetails({
-                username: 'Something went wrong D:',
-                avatar: '/',
-                status: err.message
-            })
-        );          
-    }, [props.requests])
+    useEffect(() => {}, [props.requests])
 
     return (

[Survived] StringLiteral
src/components/account/UserCard.js:23:28
 
     useEffect(() => {
         // Get location, add to queryurl
-        props.requests.get(`
-            ${process.env.REACT_APP_ENDPOINT}
-            /Account/Details
-        `).then(data => 
+        props.requests.get("").then(data => 
             updateUserDetails(data)
         ).catch(err =>

[Survived] ArrowFunction
src/components/account/UserCard.js:26:17
         props.requests.get(`
             ${process.env.REACT_APP_ENDPOINT}
             /Account/Details
-        `).then(data => 
-            updateUserDetails(data)
+        `).then(() => undefined
         ).catch(err =>
             updateUserDetails({

[Survived] ArrowFunction
src/components/account/UserCard.js:28:17
             /Account/Details
         `).then(data => 
             updateUserDetails(data)
-        ).catch(err =>
-            updateUserDetails({
-                username: 'Something went wrong D:',
-                avatar: '/',
-                status: err.message
-            })
+        ).catch(() => undefined
         );          
     }, [props.requests])

[Survived] ObjectLiteral
src/components/account/UserCard.js:29:31
         `).then(data => 
             updateUserDetails(data)
         ).catch(err =>
-            updateUserDetails({
-                username: 'Something went wrong D:',
-                avatar: '/',
-                status: err.message
-            })
+            updateUserDetails({})
         );          
     }, [props.requests])

[Survived] StringLiteral
src/components/account/UserCard.js:30:27
             updateUserDetails(data)
         ).catch(err =>
             updateUserDetails({
-                username: 'Something went wrong D:',
+                username: "",
                 avatar: '/',
                 status: err.message

[Survived] StringLiteral
src/components/account/UserCard.js:31:25
         ).catch(err =>
             updateUserDetails({
                 username: 'Something went wrong D:',
-                avatar: '/',
+                avatar: "",
                 status: err.message
             })
