[Survived] LogicalOperator
components/ui/forms/UpdatePasswordForm.js:60:29
                         margin='normal'
                         error={errors.password && touched.password}
                         helperText={
-                            errors.password && touched.password ?
+                            errors.password || touched.password ?
                             errors.password : ''
                         }

[Survived] LogicalOperator
components/ui/forms/UpdatePasswordForm.js:74:29
                         margin='normal'
                         error={errors.confirm_password && touched.confirm_password}
                         helperText={
-                            errors.confirm_password && touched.confirm_password ?
+                            errors.confirm_password || touched.confirm_password ?
                             errors.confirm_password : ''
                         }
