[Survived] BlockStatement
src/components/maps/LeafletMap.js:19:21
 
     const [mapMarkers, setMapMarkers] = useState(null)
 
-    useEffect(() => {
-        setMarkerIcons();
-    }, []);
+    useEffect(() => {}, []);
 
     useEffect(() => {

[Survived] ArrayDeclaration
src/components/maps/LeafletMap.js:21:8
 
     useEffect(() => {
         setMarkerIcons();
-    }, []);
+    }, ["Stryker was here"]);
 
     useEffect(() => {

[Survived] BlockStatement
src/components/maps/LeafletMap.js:23:21
         setMarkerIcons();
     }, []);
 
-    useEffect(() => {
-        if (props.location && props.radius) {
-            props.requests.get(`
-                ${process.env.REACT_APP_ENDPOINT}
-                /Mapmarker/Find
-                ?latitude=${props.location[0]}
-                &longitude=${props.location[1]}
-                &radius=${props.radius}
-            `).then(response => 
-                setMapMarkers(response.data.map(MapMarker))
-            ).catch(e => 
-                setMapMarkers(<ErrorModal error={e.message} />)
-            );
-        }
-    }, [props.location, props.radius, props.requests])
+    useEffect(() => {}, [props.location, props.radius, props.requests])
 
     return (

[Survived] ConditionalExpression
src/components/maps/LeafletMap.js:24:13
     }, []);
 
     useEffect(() => {
-        if (props.location && props.radius) {
+        if (false) {
             props.requests.get(`
                 ${process.env.REACT_APP_ENDPOINT}

[Survived] ConditionalExpression
src/components/maps/LeafletMap.js:24:13
     }, []);
 
     useEffect(() => {
-        if (props.location && props.radius) {
+        if (true) {
             props.requests.get(`
                 ${process.env.REACT_APP_ENDPOINT}

[Survived] ArrowFunction
src/components/maps/LeafletMap.js:31:21
                 ?latitude=${props.location[0]}
                 &longitude=${props.location[1]}
                 &radius=${props.radius}
-            `).then(response => 
-                setMapMarkers(response.data.map(MapMarker))
+            `).then(() => undefined
             ).catch(e => 
                 setMapMarkers(<ErrorModal error={e.message} />)

[Survived] ArrowFunction
src/components/maps/LeafletMap.js:33:21
                 &radius=${props.radius}
             `).then(response => 
                 setMapMarkers(response.data.map(MapMarker))
-            ).catch(e => 
-                setMapMarkers(<ErrorModal error={e.message} />)
+            ).catch(() => undefined
             );
         }

[Survived] UnaryOperator
src/components/maps/LeafletMap.js:42:45
     return (
         <Map 
             center={props.location ? 
-                props.location : [51.26829, -1.087]
+                props.location : [51.26829, +1.087]
             }
             style={{

[Survived] StringLiteral
src/components/maps/LeafletMap.js:46:25
             }
             style={{
                 width: '100%',
-                height: '100%',
+                height: "",
                 position: 'absolute',
                 zIndex: -1,

[Survived] StringLiteral
src/components/maps/LeafletMap.js:47:27
             style={{
                 width: '100%',
                 height: '100%',
-                position: 'absolute',
+                position: "",
                 zIndex: -1,
             }}

[Survived] UnaryOperator
src/components/maps/LeafletMap.js:48:25
                 width: '100%',
                 height: '100%',
                 position: 'absolute',
-                zIndex: -1,
+                zIndex: +1,
             }}
             zoom={14}
