[Survived] StringLiteral
sk8m8/src/screens/LoginScreen.js:12:23
 import slowNetwork from '../utils/browser/slowNetwork';
 import LoginForm from '../components/ui/forms/LoginForm';
 
-const axios = require('axios')
+const axios = require("")
 
 const LoginScreen = () => {

[Survived] StringLiteral
sk8m8/src/screens/LoginScreen.js:19:38
   return (
     <div className={'form-screen'}>
       <video autoPlay muted className='video-background'>
-        <source src={slowNetwork() ? '' : frontVideo} type='video/mp4' />
+        <source src={slowNetwork() ? "Stryker was here!" : frontVideo} type='video/mp4' />
       </video>
       <h1>S K 8 M 8</h1>

[Killed] StringLiteral
sk8m8/src/screens/LoginScreen.js:28:36
       <p>No account?</p>
         <Link 
           to='/signup'
-          style={{ textDecoration: 'none' }}
+          style={{ textDecoration: "" }}
         >
           <Button
