[Survived] ObjectLiteral
src/components/maps/PopupContent.js:19:15
     // prop: requests; http client
 
     const useStyles = makeStyles(theme => ({
-        card: {
-            display: 'flex',
-            minWidth: 301
-        },
+        card: {},
         details: {
             display: 'flex',

[Survived] StringLiteral
src/components/maps/PopupContent.js:20:22
 
     const useStyles = makeStyles(theme => ({
         card: {
-            display: 'flex',
+            display: "",
             minWidth: 301
         },

[Survived] StringLiteral
src/components/maps/PopupContent.js:25:28
         },
         details: {
             display: 'flex',
-            flexDirection: 'column',
+            flexDirection: "",
         },
         content: {

[Survived] ObjectLiteral
src/components/maps/PopupContent.js:27:18
             display: 'flex',
             flexDirection: 'column',
         },
-        content: {
-            flex: '1 0 auto',
-        },
+        content: {},
         cover: {
             width: 151,

[Survived] StringLiteral
src/components/maps/PopupContent.js:28:19
             flexDirection: 'column',
         },
         content: {
-            flex: '1 0 auto',
+            flex: "",
         },
         cover: {

[Survived] StringLiteral
src/components/maps/PopupContent.js:34:22
             width: 151,
         },
         controls: {
-            display: 'flex',
+            display: "",
             alignItems: 'center',
             paddingLeft: theme.spacing(1),

[Survived] ObjectLiteral
src/components/maps/PopupContent.js:39:19
             paddingLeft: theme.spacing(1),
             paddingBottom: theme.spacing(1),
         },
-        playIcon: {
-            height: 38,
-            width: 38,
-        },
+        playIcon: {},
     }));
 

[Killed] ObjectLiteral
src/components/maps/PopupContent.js:48:59
     const classes = useStyles();
     const theme = useTheme();
 
-    const [markerDetails, updateMarkerDetails] = useState({
-        name: 'Loading',
-        locationType: '',
-        creator: <img style={{minWidth: 301}} src={spinner} alt='loading' />,
-    })
+    const [markerDetails, updateMarkerDetails] = useState({})
 
     useEffect(() => {

[Killed] StringLiteral
src/components/maps/PopupContent.js:49:15
     const theme = useTheme();
 
     const [markerDetails, updateMarkerDetails] = useState({
-        name: 'Loading',
+        name: "",
         locationType: '',
         creator: <img style={{minWidth: 301}} src={spinner} alt='loading' />,

[Killed] StringLiteral
src/components/maps/PopupContent.js:50:23
 
     const [markerDetails, updateMarkerDetails] = useState({
         name: 'Loading',
-        locationType: '',
+        locationType: "Stryker was here!",
         creator: <img style={{minWidth: 301}} src={spinner} alt='loading' />,
     })

[Survived] BlockStatement
src/components/maps/PopupContent.js:54:21
         creator: <img style={{minWidth: 301}} src={spinner} alt='loading' />,
     })
 
-    useEffect(() => {
-        props.requests.get(`
-            ${process.env.REACT_APP_ENDPOINT}
-            /mapmarker/details?id=
-            ${props.markerId}
-        `).then(data => 
-            updateMarkerDetails(data)
-        ).catch(e =>
-            updateMarkerDetails(m =>  m.name = e.message)    
-        );
-    }, [props.requests, props.markerId]);
+    useEffect(() => {}, [props.requests, props.markerId]);
 
     return (

[Survived] ArrowFunction
src/components/maps/PopupContent.js:59:17
             ${process.env.REACT_APP_ENDPOINT}
             /mapmarker/details?id=
             ${props.markerId}
-        `).then(data => 
-            updateMarkerDetails(data)
+        `).then(() => undefined
         ).catch(e =>
             updateMarkerDetails(m =>  m.name = e.message)    

[Survived] ArrowFunction
src/components/maps/PopupContent.js:61:17
             ${props.markerId}
         `).then(data => 
             updateMarkerDetails(data)
-        ).catch(e =>
-            updateMarkerDetails(m =>  m.name = e.message)    
+        ).catch(() => undefined    
         );
     }, [props.requests, props.markerId]);

[Survived] ArrowFunction
src/components/maps/PopupContent.js:62:33
         `).then(data => 
             updateMarkerDetails(data)
         ).catch(e =>
-            updateMarkerDetails(m =>  m.name = e.message)    
+            updateMarkerDetails(() => undefined)    
         );
     }, [props.requests, props.markerId]);

[Killed] ConditionalExpression
src/components/maps/PopupContent.js:82:26
                 </CardContent>
                 <div className={classes.controls}>
                     <IconButton aria-label="previous">
-                        {theme.direction === 'rtl' ? <SkipNextIcon /> : <SkipPreviousIcon />}
+                        {true ? <SkipNextIcon /> : <SkipPreviousIcon />}
                     </IconButton>
                     <IconButton aria-label="play/pause">

[Killed] EqualityOperator
src/components/maps/PopupContent.js:82:26
                 </CardContent>
                 <div className={classes.controls}>
                     <IconButton aria-label="previous">
-                        {theme.direction === 'rtl' ? <SkipNextIcon /> : <SkipPreviousIcon />}
+                        {theme.direction !== 'rtl' ? <SkipNextIcon /> : <SkipPreviousIcon />}
                     </IconButton>
                     <IconButton aria-label="play/pause">

[Killed] ConditionalExpression
src/components/maps/PopupContent.js:88:26
                         <PlayArrowIcon className={classes.playIcon} />
                     </IconButton>
                     <IconButton aria-label="next">
-                        {theme.direction === 'rtl' ? <SkipPreviousIcon /> : <SkipNextIcon />}
+                        {true ? <SkipPreviousIcon /> : <SkipNextIcon />}
                     </IconButton>
                 </div>

[Killed] EqualityOperator
src/components/maps/PopupContent.js:88:26
                         <PlayArrowIcon className={classes.playIcon} />
                     </IconButton>
                     <IconButton aria-label="next">
-                        {theme.direction === 'rtl' ? <SkipPreviousIcon /> : <SkipNextIcon />}
+                        {theme.direction !== 'rtl' ? <SkipPreviousIcon /> : <SkipNextIcon />}
                     </IconButton>
                 </div>
