[Killed] BlockStatement
src/components/maps/MapMarker.js:8:28
 import PopupContent from './PopupContent';
 
 
-const MapMarker = props => {
-    // prop: coords; array, latlng
-    // prop: id; int
-
-    return (
-        <Marker key={props.id} position={props.coords}>
-            <Popup >
-                <PopupContent markerId={props.id} requests={axios} />
-            </Popup>
-        </Marker>
-    )
-}
+const MapMarker = props => {}
 
 export default MapMarker;
