[Survived] StringLiteral
src/components/people/ChatView.js:15:51
     // Prop: interlocutor; string, person we're talking to
 
     const [hubConnection, setHubConnection] = useState(null);
-    const [myMessage, updateMyMessage] = useState('');
+    const [myMessage, updateMyMessage] = useState("Stryker was here!");
     const [messages, updateMessages] = useState([
         <MessageListItem key={0} sender='' message='Loading' avatar={spinner} />

[Survived] ArrayDeclaration
src/components/people/ChatView.js:16:49
 
     const [hubConnection, setHubConnection] = useState(null);
     const [myMessage, updateMyMessage] = useState('');
-    const [messages, updateMessages] = useState([
-        <MessageListItem key={0} sender='' message='Loading' avatar={spinner} />
-    ]);
+    const [messages, updateMessages] = useState([]);
 
     useEffect(() => {

[Survived] BlockStatement
src/components/people/ChatView.js:20:21
         <MessageListItem key={0} sender='' message='Loading' avatar={spinner} />
     ]);
 
-    useEffect(() => {
-        setHubConnection(new signalR.HubConnectionBuilder()
-            .withUrl(`${process.env.REACT_APP_ENDPOINT}/hubs/chat`, { /*accessTokenFactory: getAccessToken()*/ })
-            .configureLogging(signalR.LogLevel.Information)
-            .build()
-        );
-    }, []);
+    useEffect(() => {}, []);
 
     useEffect(() => {

[Survived] BlockStatement
src/components/people/ChatView.js:28:21
         );
     }, []);
 
-    useEffect(() => {
-        if (hubConnection) {
-            hubConnection.start()
-                .then(() => console.log('Connected to chat'))
-                .catch(err => updateMessages([
-                    <MessageListItem key={0} sender='Uh oh D:' message={err} avatar={ErrorOutlineIcon} />
-                ]));
-            
-            // Might need updating
-            hubConnection.on('ReceiveMessage', (req) => {
-                updateMessages(m => [
-                    ...m,
-                    MessageListItem(req)
-                ])
-            })
-        }
-    }, [hubConnection])
+    useEffect(() => {}, [hubConnection])
 
     const sendMessage = async (interlocutor, message) => {

[Survived] ConditionalExpression
src/components/people/ChatView.js:29:13
     }, []);
 
     useEffect(() => {
-        if (hubConnection) {
+        if (false) {
             hubConnection.start()
                 .then(() => console.log('Connected to chat'))

[Survived] ConditionalExpression
src/components/people/ChatView.js:29:13
     }, []);
 
     useEffect(() => {
-        if (hubConnection) {
+        if (true) {
             hubConnection.start()
                 .then(() => console.log('Connected to chat'))

[Survived] ArrowFunction
src/components/people/ChatView.js:31:23
     useEffect(() => {
         if (hubConnection) {
             hubConnection.start()
-                .then(() => console.log('Connected to chat'))
+                .then(() => undefined)
                 .catch(err => updateMessages([
                     <MessageListItem key={0} sender='Uh oh D:' message={err} avatar={ErrorOutlineIcon} />

[Survived] ArrowFunction
src/components/people/ChatView.js:32:24
         if (hubConnection) {
             hubConnection.start()
                 .then(() => console.log('Connected to chat'))
-                .catch(err => updateMessages([
-                    <MessageListItem key={0} sender='Uh oh D:' message={err} avatar={ErrorOutlineIcon} />
-                ]));
+                .catch(() => undefined);
             
             // Might need updating

[Survived] BlockStatement
src/components/people/ChatView.js:37:57
                 ]));
             
             // Might need updating
-            hubConnection.on('ReceiveMessage', (req) => {
-                updateMessages(m => [
-                    ...m,
-                    MessageListItem(req)
-                ])
-            })
+            hubConnection.on('ReceiveMessage', (req) => {})
         }
     }, [hubConnection])

[Survived] ArrowFunction
src/components/people/ChatView.js:38:32
             
             // Might need updating
             hubConnection.on('ReceiveMessage', (req) => {
-                updateMessages(m => [
-                    ...m,
-                    MessageListItem(req)
-                ])
+                updateMessages(() => undefined)
             })
         }

[Survived] ArrayDeclaration
src/components/people/ChatView.js:38:37
             
             // Might need updating
             hubConnection.on('ReceiveMessage', (req) => {
-                updateMessages(m => [
-                    ...m,
-                    MessageListItem(req)
-                ])
+                updateMessages(m => [])
             })
         }

[Survived] ArrayDeclaration
src/components/people/ChatView.js:44:8
                 ])
             })
         }
-    }, [hubConnection])
+    }, [])
 
     const sendMessage = async (interlocutor, message) => {

[Survived] BlockStatement
src/components/people/ChatView.js:46:58
         }
     }, [hubConnection])
 
-    const sendMessage = async (interlocutor, message) => {
-        hubConnection
-            .invoke('SendMessage', interlocutor, message)
-            .catch(err => updateMessages([
-                ...messages,
-                <MessageListItem key={0} sender='Uh oh D:' message={err} avatar={ErrorOutlineIcon} />
-            ]));
-        updateMyMessage('');
-    }
+    const sendMessage = async (interlocutor, message) => {}
 
     return(

[Survived] StringLiteral
src/components/people/ChatView.js:48:21
 
     const sendMessage = async (interlocutor, message) => {
         hubConnection
-            .invoke('SendMessage', interlocutor, message)
+            .invoke("", interlocutor, message)
             .catch(err => updateMessages([
                 ...messages,

[Survived] ArrowFunction
src/components/people/ChatView.js:49:20
     const sendMessage = async (interlocutor, message) => {
         hubConnection
             .invoke('SendMessage', interlocutor, message)
-            .catch(err => updateMessages([
-                ...messages,
-                <MessageListItem key={0} sender='Uh oh D:' message={err} avatar={ErrorOutlineIcon} />
-            ]));
+            .catch(() => undefined);
         updateMyMessage('');
     }

[Survived] ArrowFunction
src/components/people/ChatView.js:70:31
                     variant="outlined"
                     multiline
                     rowsMax="20"
-                    onChange={e => updateMyMessage(e.target.value)}
+                    onChange={() => undefined}
                 />
                 <Button

[Survived] ArrowFunction
src/components/people/ChatView.js:76:30
                     variant="outlined"
                     color="primary"
                     component="span"
-                    onClick={() => sendMessage(props.interlocutor, myMessage)}
+                    onClick={() => undefined}
                 >
                     Send
