[Killed] ArrowFunction
src/components/people/MessageListItem.js:16:34
     // Prop: avatar; string, url src
     // Prop: message; string
 
-    const useStyles = makeStyles(theme => ({
-        root: {
-          width: '100%',
-          maxWidth: 360,
-          backgroundColor: theme.palette.background.paper,
-        },
-        inline: {
-          display: 'inline',
-        },
-    }));
+    const useStyles = makeStyles(() => undefined);
 
     const classes = useStyles();

[Survived] StringLiteral
src/components/people/MessageListItem.js:18:18
 
     const useStyles = makeStyles(theme => ({
         root: {
-          width: '100%',
+          width: "",
           maxWidth: 360,
           backgroundColor: theme.palette.background.paper,

[Survived] ObjectLiteral
src/components/people/MessageListItem.js:22:17
           maxWidth: 360,
           backgroundColor: theme.palette.background.paper,
         },
-        inline: {
-          display: 'inline',
-        },
+        inline: {},
     }));
 
