[Killed] ArrayDeclaration
src/components/people/PeopleListing.js:14:58
     // Prop: requests; http client
     // Prop: location; latlong array
 
-    const [peopleListInfo, setPeopleListInfo] = useState([{
-        key: 0,
-        username: 'Loading...',
-        avatar: spinner,
-        bio: '',
-        chat: function(){}
-    }]);
+    const [peopleListInfo, setPeopleListInfo] = useState([]);
     const [interlocutor, setInterlocutor] = useState('');
     const [chatting, setChatting] = useState(false);

[Killed] StringLiteral
src/components/people/PeopleListing.js:16:19
 
     const [peopleListInfo, setPeopleListInfo] = useState([{
         key: 0,
-        username: 'Loading...',
+        username: "",
         avatar: spinner,
         bio: '',

[Killed] BooleanLiteral
src/components/people/PeopleListing.js:22:46
         chat: function(){}
     }]);
     const [interlocutor, setInterlocutor] = useState('');
-    const [chatting, setChatting] = useState(false);
+    const [chatting, setChatting] = useState(true);
 
     const toggleChat = username => {

[Survived] BlockStatement
src/components/people/PeopleListing.js:24:36
     const [interlocutor, setInterlocutor] = useState('');
     const [chatting, setChatting] = useState(false);
 
-    const toggleChat = username => {
-        setChatting(x => !x)
-        setInterlocutor(username || '')
-    }
+    const toggleChat = username => {}
 
     useEffect(() => {

[Survived] ArrowFunction
src/components/people/PeopleListing.js:25:21
     const [chatting, setChatting] = useState(false);
 
     const toggleChat = username => {
-        setChatting(x => !x)
+        setChatting(() => undefined)
         setInterlocutor(username || '')
     }

[Survived] BooleanLiteral
src/components/people/PeopleListing.js:25:26
     const [chatting, setChatting] = useState(false);
 
     const toggleChat = username => {
-        setChatting(x => !x)
+        setChatting(x => x)
         setInterlocutor(username || '')
     }

[Survived] ConditionalExpression
src/components/people/PeopleListing.js:26:25
 
     const toggleChat = username => {
         setChatting(x => !x)
-        setInterlocutor(username || '')
+        setInterlocutor(false)
     }
 

[Survived] ConditionalExpression
src/components/people/PeopleListing.js:26:25
 
     const toggleChat = username => {
         setChatting(x => !x)
-        setInterlocutor(username || '')
+        setInterlocutor(true)
     }
 

[Survived] BlockStatement
src/components/people/PeopleListing.js:29:21
         setInterlocutor(username || '')
     }
 
-    useEffect(() => {
-        // Get location, add to queryurl
-        props.requests.get(`
-            ${process.env.REACT_APP_ENDPOINT}
-            /People/Find
-            ?latitude=${props.location[0]}
-            &longitude=${props.location[1]}
-            &radius=${50}
-        `).then(data => {
-            data.chat = toggleChat
-            setPeopleListInfo(data)
-        }).catch(err =>
-            setPeopleListInfo([{
-                key: 0,
-                username: 'Something went wrong D:',
-                avatar: '',
-                bio: err.message,
-                chat: function(){}
-            }])
-        );          
-    }, [props.requests, props.location])
+    useEffect(() => {}, [props.requests, props.location])
 
     return (

[Survived] BlockStatement
src/components/people/PeopleListing.js:37:25
             ?latitude=${props.location[0]}
             &longitude=${props.location[1]}
             &radius=${50}
-        `).then(data => {
-            data.chat = toggleChat
-            setPeopleListInfo(data)
-        }).catch(err =>
+        `).then(data => {}).catch(err =>
             setPeopleListInfo([{
                 key: 0,

[Survived] ArrowFunction
src/components/people/PeopleListing.js:40:18
         `).then(data => {
             data.chat = toggleChat
             setPeopleListInfo(data)
-        }).catch(err =>
-            setPeopleListInfo([{
-                key: 0,
-                username: 'Something went wrong D:',
-                avatar: '',
-                bio: err.message,
-                chat: function(){}
-            }])
+        }).catch(() => undefined
         );          
     }, [props.requests, props.location])

[Survived] ObjectLiteral
src/components/people/PeopleListing.js:41:32
             data.chat = toggleChat
             setPeopleListInfo(data)
         }).catch(err =>
-            setPeopleListInfo([{
-                key: 0,
-                username: 'Something went wrong D:',
-                avatar: '',
-                bio: err.message,
-                chat: function(){}
-            }])
+            setPeopleListInfo([{}])
         );          
     }, [props.requests, props.location])

[Survived] StringLiteral
src/components/people/PeopleListing.js:44:25
             setPeopleListInfo([{
                 key: 0,
                 username: 'Something went wrong D:',
-                avatar: '',
+                avatar: "Stryker was here!",
                 bio: err.message,
                 chat: function(){}

[Survived] ArrayDeclaration
src/components/people/PeopleListing.js:49:8
                 chat: function(){}
             }])
         );          
-    }, [props.requests, props.location])
+    }, [])
 
     return (

[Survived] ArrowFunction
src/components/people/PeopleListing.js:59:26
             <div style={{marginBottom: 100}}></div>
             <SwipeableDrawer
                 open={chatting}
-                onClose={() => setChatting()}
+                onClose={() => undefined}
                 onOpen={() => setChatting()}
             >

[Survived] ArrowFunction
src/components/people/PeopleListing.js:60:25
             <SwipeableDrawer
                 open={chatting}
                 onClose={() => setChatting()}
-                onOpen={() => setChatting()}
+                onOpen={() => undefined}
             >
                 <ChatView interlocutor={interlocutor} />
