[Survived] ArrowFunction
src/components/people/PersonListItem.js:42:30
                 <ChatIcon
                     color='primary'
                     fontSize='large'
-                    onClick={() => props.chat(props.username)}
+                    onClick={() => undefined}
                 />
             </ListItem>
