[Killed] ArrowFunction
src/components/routing/PrivateRoute.js:8:22
 } from "react-router-dom";
 import getCookie from '../../utils/browser/getCookie';
 
-const PrivateRoute = ({ component: Component, ...rest }) => (
-  <Route {...rest} render={(props) => (
-    getCookie('jwt') ?
-      <Component {...props} /> :
-      <Redirect to={{
-        pathname: '/login',
-        state: { from: props.location }
-      }} />
-  )} />
-)
+const PrivateRoute = () => undefined
 
 export default PrivateRoute

[Survived] ArrowFunction
src/components/routing/PrivateRoute.js:9:28
 import getCookie from '../../utils/browser/getCookie';
 
 const PrivateRoute = ({ component: Component, ...rest }) => (
-  <Route {...rest} render={(props) => (
-    getCookie('jwt') ?
-      <Component {...props} /> :
-      <Redirect to={{
-        pathname: '/login',
-        state: { from: props.location }
-      }} />
-  )} />
+  <Route {...rest} render={() => undefined} />
 )
 

[Survived] ObjectLiteral
src/components/routing/PrivateRoute.js:12:21
   <Route {...rest} render={(props) => (
     getCookie('jwt') ?
       <Component {...props} /> :
-      <Redirect to={{
-        pathname: '/login',
-        state: { from: props.location }
-      }} />
+      <Redirect to={{}} />
   )} />
 )

[Killed] StringLiteral
src/components/routing/PrivateRoute.js:13:19
     getCookie('jwt') ?
       <Component {...props} /> :
       <Redirect to={{
-        pathname: '/login',
+        pathname: "",
         state: { from: props.location }
       }} />
