[Survived] BlockStatement
components/ui/forms/CreateMarkerForm.js:25:21
         <option>Loading...</option>
     );
 
-    useEffect(() => {
-        props.requests.get(`
-            ${process.env.REACT_APP_ENDPOINT}
-            /mapmarker/locationTypes
-        `).then(data => {
-            const options = data.map((index, type) =>
-                <option key={index}>{type}</option>
-            );
-            options.unshift(<option key="blank" ></option>)
-            updateLocationTypes(options);
-        }).catch( updateLocationTypes(
-                <option>Something went wrong D:</option>
-            ));
-    }, [props.requests]);
+    useEffect(() => {}, [props.requests]);
 
     const validationSchema = Yup.object().shape({

[Survived] BlockStatement
components/ui/forms/CreateMarkerForm.js:29:25
         props.requests.get(`
             ${process.env.REACT_APP_ENDPOINT}
             /mapmarker/locationTypes
-        `).then(data => {
-            const options = data.map((index, type) =>
-                <option key={index}>{type}</option>
-            );
-            options.unshift(<option key="blank" ></option>)
-            updateLocationTypes(options);
-        }).catch( updateLocationTypes(
+        `).then(data => {}).catch( updateLocationTypes(
                 <option>Something went wrong D:</option>
             ));

[Survived] ArrowFunction
components/ui/forms/CreateMarkerForm.js:30:38
             ${process.env.REACT_APP_ENDPOINT}
             /mapmarker/locationTypes
         `).then(data => {
-            const options = data.map((index, type) =>
-                <option key={index}>{type}</option>
+            const options = data.map(() => undefined
             );
             options.unshift(<option key="blank" ></option>)

[Survived] ObjectLiteral
components/ui/forms/CreateMarkerForm.js:40:49
             ));
     }, [props.requests]);
 
-    const validationSchema = Yup.object().shape({
-        marker_name: Yup.string()
-            .required("Please give your marker a name")
-            .min(3, "min. 3 characters"),
-        location_type: Yup.string()
-            .required("What kind of location are you marking?"),
-        marker_video: Yup.mixed()
-            .required("We need a video!")
-            .test(
-                "fileSize",
-                "Your video is too big :(",
-                value => value && value.size <= 262144000
-            )
-    })
+    const validationSchema = Yup.object().shape({})
 
     return (

[Survived] StringLiteral
components/ui/forms/CreateMarkerForm.js:45:23
             .required("Please give your marker a name")
             .min(3, "min. 3 characters"),
         location_type: Yup.string()
-            .required("What kind of location are you marking?"),
+            .required(""),
         marker_video: Yup.mixed()
             .required("We need a video!")

[Survived] ConditionalExpression
components/ui/forms/CreateMarkerForm.js:51:35
             .test(
                 "fileSize",
                 "Your video is too big :(",
-                value => value && value.size <= 262144000
+                value => value && true
             )
     })

[Survived] ArrowFunction
components/ui/forms/CreateMarkerForm.js:51:17
             .test(
                 "fileSize",
                 "Your video is too big :(",
-                value => value && value.size <= 262144000
+                () => undefined
             )
     })

[Killed] StringLiteral
components/ui/forms/CreateMarkerForm.js:63:36
             <Formik
                 initialValues={{
                     marker_name: '',
-                    location_type: '',
+                    location_type: "Stryker was here!",
                     marker_video: null,
                     location: props.location,

[Survived] BlockStatement
components/ui/forms/CreateMarkerForm.js:68:58
                     location: props.location,
                 }}
                 validationSchema={validationSchema}
-                onSubmit={(values, { setSubmitting }) => {
-                    console.log(values);
-                    setSubmitting(true);
-                }}
+                onSubmit={(values, { setSubmitting }) => {}}
 
                 render={({

[Survived] BooleanLiteral
components/ui/forms/CreateMarkerForm.js:70:35
                 validationSchema={validationSchema}
                 onSubmit={(values, { setSubmitting }) => {
                     console.log(values);
-                    setSubmitting(true);
+                    setSubmitting(false);
                 }}
 

[Killed] ConditionalExpression
components/ui/forms/CreateMarkerForm.js:99:40
                                 onBlur={handleBlur}
                                 value={values.marker_name}
                                 margin='normal'
-                                error={errors.marker_name && touched.marker_name}
+                                error={true}
                                 helperText={
                                     errors.marker_name && touched.marker_name ?

[Survived] LogicalOperator
components/ui/forms/CreateMarkerForm.js:99:40
                                 onBlur={handleBlur}
                                 value={values.marker_name}
                                 margin='normal'
-                                error={errors.marker_name && touched.marker_name}
+                                error={errors.marker_name || touched.marker_name}
                                 helperText={
                                     errors.marker_name && touched.marker_name ?

[Killed] ConditionalExpression
components/ui/forms/CreateMarkerForm.js:101:37
                                 margin='normal'
                                 error={errors.marker_name && touched.marker_name}
                                 helperText={
-                                    errors.marker_name && touched.marker_name ?
+                                    true ?
                                         errors.marker_name : ''
                                 }

[Survived] ConditionalExpression
components/ui/forms/CreateMarkerForm.js:101:37
                                 margin='normal'
                                 error={errors.marker_name && touched.marker_name}
                                 helperText={
-                                    errors.marker_name && touched.marker_name ?
+                                    false ?
                                         errors.marker_name : ''
                                 }

[Killed] StringLiteral
components/ui/forms/CreateMarkerForm.js:102:62
                                 error={errors.marker_name && touched.marker_name}
                                 helperText={
                                     errors.marker_name && touched.marker_name ?
-                                        errors.marker_name : ''
+                                        errors.marker_name : "Stryker was here!"
                                 }
                             />

[Killed] ObjectLiteral
components/ui/forms/CreateMarkerForm.js:105:65
                                         errors.marker_name : ''
                                 }
                             />
-                            <FormControl margin='normal' style={{ maxWidth: 200 }}>
+                            <FormControl margin='normal' style={{}}>
                                 <InputLabel htmlFor="location_type">Location Type</InputLabel>
                                 <Select

[Killed] ConditionalExpression
components/ui/forms/CreateMarkerForm.js:117:34
                                 >
                                     {locationTypes}
                                 </Select>
-                                {errors.location_type &&
-                                    touched.location_type &&
+                                {true &&
                                     <FormHelperText id="location_type_helper_text" error={true}>
                                         {errors.location_type}

[Killed] LogicalOperator
components/ui/forms/CreateMarkerForm.js:117:34
                                 >
                                     {locationTypes}
                                 </Select>
-                                {errors.location_type &&
-                                    touched.location_type &&
-                                    <FormHelperText id="location_type_helper_text" error={true}>
-                                        {errors.location_type}
-                                    </FormHelperText>
+                                {errors.location_type && touched.location_type || <FormHelperText id="location_type_helper_text" error={true}>
+                                        {errors.location_type}
+                                    </FormHelperText>
                                 }
                             </FormControl>

[Survived] BooleanLiteral
components/ui/forms/CreateMarkerForm.js:119:91
                                 </Select>
                                 {errors.location_type &&
                                     touched.location_type &&
-                                    <FormHelperText id="location_type_helper_text" error={true}>
+                                    <FormHelperText id="location_type_helper_text" error={false}>
                                         {errors.location_type}
                                     </FormHelperText>

[Killed] ConditionalExpression
components/ui/forms/CreateMarkerForm.js:142:43
                                 type="submit"
                                 margin='normal'
                                 className={formClasses.submit}
-                                disabled={isSubmitting || !isValid}
+                                disabled={false}
                             >
                                 Create

[Killed] BooleanLiteral
components/ui/forms/CreateMarkerForm.js:142:59
                                 type="submit"
                                 margin='normal'
                                 className={formClasses.submit}
-                                disabled={isSubmitting || !isValid}
+                                disabled={isSubmitting || isValid}
                             >
                                 Create
