[Killed] BooleanLiteral
components/ui/forms/SignupForm.js:15:44
 const SignupForm = ({ requests }) => {
     const formClasses = formStyles();
 
-    const [success, setSuccess] = useState(false);
+    const [success, setSuccess] = useState(true);
     const [submitError, setSubmitError] = useState(null);
 

[Survived] StringLiteral
components/ui/forms/SignupForm.js:20:20
 
     const validationSchema = Yup.object().shape({
         email: Yup.string()
-            .email("Please enter a valid email address")
+            .email("")
             .required("Please enter your email address"),
         confirm_email: Yup.string()

[Survived] StringLiteral
components/ui/forms/SignupForm.js:23:46
             .email("Please enter a valid email address")
             .required("Please enter your email address"),
         confirm_email: Yup.string()
-            .oneOf([Yup.ref('email'), null], 'Emails must match'),
+            .oneOf([Yup.ref('email'), null], ""),
         username: Yup.string()
             .min(3, "Username must be at least 3 characters")

[Survived] StringLiteral
components/ui/forms/SignupForm.js:25:21
         confirm_email: Yup.string()
             .oneOf([Yup.ref('email'), null], 'Emails must match'),
         username: Yup.string()
-            .min(3, "Username must be at least 3 characters")
+            .min(3, "")
             .required("Please enter a username"),
         password: Yup.string()

[Survived] StringLiteral
components/ui/forms/SignupForm.js:26:23
             .oneOf([Yup.ref('email'), null], 'Emails must match'),
         username: Yup.string()
             .min(3, "Username must be at least 3 characters")
-            .required("Please enter a username"),
+            .required(""),
         password: Yup.string()
             .min(6, "min. 6 characters")

[Survived] StringLiteral
components/ui/forms/SignupForm.js:31:49
             .min(6, "min. 6 characters")
             .required("Please enter your password"),
         confirm_password: Yup.string()
-            .oneOf([Yup.ref('password'), null], 'Passwords must match')
+            .oneOf([Yup.ref('password'), null], "")
     })
 

[Killed] StringLiteral
components/ui/forms/SignupForm.js:41:28
             }
             <Formik
                 initialValues={{
-                    email: '',
+                    email: "Stryker was here!",
                     confirm_email: '',
                     username: '',

[Killed] StringLiteral
components/ui/forms/SignupForm.js:42:36
             <Formik
                 initialValues={{
                     email: '',
-                    confirm_email: '',
+                    confirm_email: "Stryker was here!",
                     username: '',
                     password: '',

[Killed] StringLiteral
components/ui/forms/SignupForm.js:43:31
                 initialValues={{
                     email: '',
                     confirm_email: '',
-                    username: '',
+                    username: "Stryker was here!",
                     password: '',
                     confirm_password: '',

[Survived] BlockStatement
components/ui/forms/SignupForm.js:48:58
                     confirm_password: '',
                 }}
                 validationSchema={validationSchema}
-                onSubmit={(values, { setSubmitting }) => {
-                    setSubmitting(true);
-                    requests.post(
-                        `${process.env.REACT_APP_ENDPOINT}/account/create`,
-                        values
-                    ).then(response =>
-                        setSuccess(true)
-                    ).catch(err => {
-                        setSubmitError(err.message);
-                        setSubmitting(false);
-                    }
-                    );
-
-                }}
+                onSubmit={(values, { setSubmitting }) => {}}
 
                 render={({

[Survived] BooleanLiteral
components/ui/forms/SignupForm.js:49:35
                 }}
                 validationSchema={validationSchema}
                 onSubmit={(values, { setSubmitting }) => {
-                    setSubmitting(true);
+                    setSubmitting(false);
                     requests.post(
                         `${process.env.REACT_APP_ENDPOINT}/account/create`,

[Survived] ArrowFunction
components/ui/forms/SignupForm.js:53:28
                     requests.post(
                         `${process.env.REACT_APP_ENDPOINT}/account/create`,
                         values
-                    ).then(response =>
-                        setSuccess(true)
+                    ).then(() => undefined
                     ).catch(err => {
                         setSubmitError(err.message);

[Survived] BooleanLiteral
components/ui/forms/SignupForm.js:54:36
                         `${process.env.REACT_APP_ENDPOINT}/account/create`,
                         values
                     ).then(response =>
-                        setSuccess(true)
+                        setSuccess(false)
                     ).catch(err => {
                         setSubmitError(err.message);

[Survived] BlockStatement
components/ui/forms/SignupForm.js:55:36
                         values
                     ).then(response =>
                         setSuccess(true)
-                    ).catch(err => {
-                        setSubmitError(err.message);
-                        setSubmitting(false);
-                    }
+                    ).catch(err => {}
                     );
 

[Survived] BooleanLiteral
components/ui/forms/SignupForm.js:57:39
                         setSuccess(true)
                     ).catch(err => {
                         setSubmitError(err.message);
-                        setSubmitting(false);
+                        setSubmitting(true);
                     }
                     );

[Killed] ConditionalExpression
components/ui/forms/SignupForm.js:85:40
                                 onBlur={handleBlur}
                                 value={values.email}
                                 margin='normal'
-                                error={errors.email && touched.email}
+                                error={true}
                                 helperText={
                                     errors.email && touched.email ?

[Survived] ConditionalExpression
components/ui/forms/SignupForm.js:85:40
                                 onBlur={handleBlur}
                                 value={values.email}
                                 margin='normal'
-                                error={errors.email && touched.email}
+                                error={false}
                                 helperText={
                                     errors.email && touched.email ?

[Killed] ConditionalExpression
components/ui/forms/SignupForm.js:87:37
                                 margin='normal'
                                 error={errors.email && touched.email}
                                 helperText={
-                                    errors.email && touched.email ?
+                                    true ?
                                         errors.email : ''
                                 }

[Survived] LogicalOperator
components/ui/forms/SignupForm.js:87:37
                                 margin='normal'
                                 error={errors.email && touched.email}
                                 helperText={
-                                    errors.email && touched.email ?
+                                    errors.email || touched.email ?
                                         errors.email : ''
                                 }

[Killed] ConditionalExpression
components/ui/forms/SignupForm.js:99:40
                                 onBlur={handleBlur}
                                 value={values.confirm_email}
                                 margin='normal'
-                                error={errors.confirm_email && touched.confirm_email}
+                                error={true}
                                 helperText={
                                     errors.confirm_email && touched.confirm_email ?

[Survived] ConditionalExpression
components/ui/forms/SignupForm.js:99:40
                                 onBlur={handleBlur}
                                 value={values.confirm_email}
                                 margin='normal'
-                                error={errors.confirm_email && touched.confirm_email}
+                                error={false}
                                 helperText={
                                     errors.confirm_email && touched.confirm_email ?

[Killed] ConditionalExpression
components/ui/forms/SignupForm.js:101:37
                                 margin='normal'
                                 error={errors.confirm_email && touched.confirm_email}
                                 helperText={
-                                    errors.confirm_email && touched.confirm_email ?
+                                    true ?
                                         errors.confirm_email : ''
                                 }

[Survived] LogicalOperator
components/ui/forms/SignupForm.js:101:37
                                 margin='normal'
                                 error={errors.confirm_email && touched.confirm_email}
                                 helperText={
-                                    errors.confirm_email && touched.confirm_email ?
+                                    errors.confirm_email || touched.confirm_email ?
                                         errors.confirm_email : ''
                                 }

[Killed] ConditionalExpression
components/ui/forms/SignupForm.js:113:40
                                 onBlur={handleBlur}
                                 value={values.username}
                                 margin='normal'
-                                error={errors.username && touched.username}
+                                error={true}
                                 helperText={
                                     errors.username && touched.username ?

[Survived] ConditionalExpression
components/ui/forms/SignupForm.js:113:40
                                 onBlur={handleBlur}
                                 value={values.username}
                                 margin='normal'
-                                error={errors.username && touched.username}
+                                error={false}
                                 helperText={
                                     errors.username && touched.username ?

[Killed] ConditionalExpression
components/ui/forms/SignupForm.js:115:37
                                 margin='normal'
                                 error={errors.username && touched.username}
                                 helperText={
-                                    errors.username && touched.username ?
+                                    true ?
                                         errors.username : ''
                                 }

[Survived] ConditionalExpression
components/ui/forms/SignupForm.js:115:37
                                 margin='normal'
                                 error={errors.username && touched.username}
                                 helperText={
-                                    errors.username && touched.username ?
+                                    false ?
                                         errors.username : ''
                                 }

[Killed] StringLiteral
components/ui/forms/SignupForm.js:116:59
                                 error={errors.username && touched.username}
                                 helperText={
                                     errors.username && touched.username ?
-                                        errors.username : ''
+                                        errors.username : "Stryker was here!"
                                 }
                             />

[Killed] ConditionalExpression
components/ui/forms/SignupForm.js:127:40
                                 onBlur={handleBlur}
                                 value={values.password}
                                 margin='normal'
-                                error={errors.password && touched.password}
+                                error={true}
                                 helperText={
                                     errors.password && touched.password ?

[Survived] ConditionalExpression
components/ui/forms/SignupForm.js:127:40
                                 onBlur={handleBlur}
                                 value={values.password}
                                 margin='normal'
-                                error={errors.password && touched.password}
+                                error={false}
                                 helperText={
                                     errors.password && touched.password ?

[Killed] ConditionalExpression
components/ui/forms/SignupForm.js:129:37
                                 margin='normal'
                                 error={errors.password && touched.password}
                                 helperText={
-                                    errors.password && touched.password ?
+                                    true ?
                                         errors.password : ''
                                 }

[Survived] ConditionalExpression
components/ui/forms/SignupForm.js:129:37
                                 margin='normal'
                                 error={errors.password && touched.password}
                                 helperText={
-                                    errors.password && touched.password ?
+                                    false ?
                                         errors.password : ''
                                 }

[Killed] StringLiteral
components/ui/forms/SignupForm.js:130:59
                                 error={errors.password && touched.password}
                                 helperText={
                                     errors.password && touched.password ?
-                                        errors.password : ''
+                                        errors.password : "Stryker was here!"
                                 }
                             />

[Killed] ConditionalExpression
components/ui/forms/SignupForm.js:141:40
                                 onBlur={handleBlur}
                                 value={values.confirm_password}
                                 margin='normal'
-                                error={errors.confirm_password && touched.confirm_password}
+                                error={true}
                                 helperText={
                                     errors.confirm_password && touched.confirm_password ?

[Survived] LogicalOperator
components/ui/forms/SignupForm.js:141:40
                                 onBlur={handleBlur}
                                 value={values.confirm_password}
                                 margin='normal'
-                                error={errors.confirm_password && touched.confirm_password}
+                                error={errors.confirm_password || touched.confirm_password}
                                 helperText={
                                     errors.confirm_password && touched.confirm_password ?

[Killed] ConditionalExpression
components/ui/forms/SignupForm.js:143:37
                                 margin='normal'
                                 error={errors.confirm_password && touched.confirm_password}
                                 helperText={
-                                    errors.confirm_password && touched.confirm_password ?
+                                    true ?
                                         errors.confirm_password : ''
                                 }

[Survived] ConditionalExpression
components/ui/forms/SignupForm.js:143:37
                                 margin='normal'
                                 error={errors.confirm_password && touched.confirm_password}
                                 helperText={
-                                    errors.confirm_password && touched.confirm_password ?
+                                    false ?
                                         errors.confirm_password : ''
                                 }

[Killed] BooleanLiteral
components/ui/forms/SignupForm.js:149:40
                             />
                             <FormHelperText
                                 component={'span'}
-                                error={true}
+                                error={false}
                             >
                                 {submitError}

[Killed] LogicalOperator
components/ui/forms/SignupForm.js:160:43
                                 type="submit"
                                 margin='normal'
                                 className={formClasses.submit}
-                                disabled={isSubmitting || !isValid}
+                                disabled={isSubmitting && !isValid}
                             >
                                 Sign up
