[Survived] StringLiteral
components/ui/forms/UpdateEmailForm.js:27:27
                 email: '',
                 confirm_email: '',
                 username: '',
-                password: '',
+                password: "Stryker was here!",
                 confirm_password: '',
             }}

[Survived] StringLiteral
components/ui/forms/UpdateEmailForm.js:28:35
                 confirm_email: '',
                 username: '',
                 password: '',
-                confirm_password: '',
+                confirm_password: "Stryker was here!",
             }}
             validationSchema={validationSchema}

[Survived] BlockStatement
components/ui/forms/UpdateEmailForm.js:31:53
                 confirm_password: '',
             }}
             validationSchema={validationSchema}
-            onSubmit={(values, { setSubmitting }) =>{
-                console.log(values)
-                setSubmitting(true);
-            }}
+            onSubmit={(values, { setSubmitting }) =>{}}
             
             render={({

[Survived] BooleanLiteral
components/ui/forms/UpdateEmailForm.js:33:31
             validationSchema={validationSchema}
             onSubmit={(values, { setSubmitting }) =>{
                 console.log(values)
-                setSubmitting(true);
+                setSubmitting(false);
             }}
             

[Survived] LogicalOperator
components/ui/forms/UpdateEmailForm.js:58:32
                         onBlur={handleBlur}
                         value={values.email}
                         margin='normal'
-                        error={errors.email && touched.email}
+                        error={errors.email || touched.email}
                         helperText={
                             errors.email && touched.email ?

[Survived] ConditionalExpression
components/ui/forms/UpdateEmailForm.js:74:29
                         margin='normal'
                         error={errors.confirm_email && touched.confirm_email}
                         helperText={
-                            errors.confirm_email && touched.confirm_email ?
+                            false ?
                             errors.confirm_email : ''
                         }

[Killed] StringLiteral
components/ui/forms/UpdateEmailForm.js:75:52
                         error={errors.confirm_email && touched.confirm_email}
                         helperText={
                             errors.confirm_email && touched.confirm_email ?
-                            errors.confirm_email : ''
+                            errors.confirm_email : "Stryker was here!"
                         }
                     />
