[Killed] LogicalOperator
components/ui/forms/UpdateStatusForm.js:21:42
     return (
         <div>
             <Formik
-                initialValues={{ status: props.currentStatus || 'Whatcha sayin?', }}
+                initialValues={{ status: props.currentStatus && 'Whatcha sayin?', }}
                 onSubmit={(values, { setSubmitting }) => {
                     console.log(values)

[Killed] ConditionalExpression
components/ui/forms/UpdateStatusForm.js:21:42
     return (
         <div>
             <Formik
-                initialValues={{ status: props.currentStatus || 'Whatcha sayin?', }}
+                initialValues={{ status: true, }}
                 onSubmit={(values, { setSubmitting }) => {
                     console.log(values)

[Survived] BlockStatement
components/ui/forms/UpdateStatusForm.js:22:58
         <div>
             <Formik
                 initialValues={{ status: props.currentStatus || 'Whatcha sayin?', }}
-                onSubmit={(values, { setSubmitting }) => {
-                    console.log(values)
-                    setSubmitting(true);
-                    props.requests.post(
-                        `${process.env.REACT_APP_ENDPOINT}/account/status`,
-                        values
-                    ).then(response =>
-                        setSubmitting(false)
-                    ).catch(err => {
-                        setSubmitting(false);
-                        setSubmitError(err.message);
-                    })
-                }}
+                onSubmit={(values, { setSubmitting }) => {}}
 
                 render={({

[Survived] StringLiteral
components/ui/forms/UpdateStatusForm.js:26:25
                     console.log(values)
                     setSubmitting(true);
                     props.requests.post(
-                        `${process.env.REACT_APP_ENDPOINT}/account/status`,
+                        "",
                         values
                     ).then(response =>

[Survived] ArrowFunction
components/ui/forms/UpdateStatusForm.js:28:28
                     props.requests.post(
                         `${process.env.REACT_APP_ENDPOINT}/account/status`,
                         values
-                    ).then(response =>
-                        setSubmitting(false)
+                    ).then(() => undefined
                     ).catch(err => {
                         setSubmitting(false);

[Survived] BooleanLiteral
components/ui/forms/UpdateStatusForm.js:29:39
                         `${process.env.REACT_APP_ENDPOINT}/account/status`,
                         values
                     ).then(response =>
-                        setSubmitting(false)
+                        setSubmitting(true)
                     ).catch(err => {
                         setSubmitting(false);

[Survived] BlockStatement
components/ui/forms/UpdateStatusForm.js:30:36
                         values
                     ).then(response =>
                         setSubmitting(false)
-                    ).catch(err => {
-                        setSubmitting(false);
-                        setSubmitError(err.message);
-                    })
+                    ).catch(err => {})
                 }}
 

[Survived] BooleanLiteral
components/ui/forms/UpdateStatusForm.js:31:39
                     ).then(response =>
                         setSubmitting(false)
                     ).catch(err => {
-                        setSubmitting(false);
+                        setSubmitting(true);
                         setSubmitError(err.message);
                     })

[Killed] ConditionalExpression
components/ui/forms/UpdateStatusForm.js:59:40
                                 margin='normal'
                                 multiline
                                 rows="4"
-                                error={errors.status && touched.status}
+                                error={true}
                                 helperText={
                                     errors.status && touched.status ?

[Survived] LogicalOperator
components/ui/forms/UpdateStatusForm.js:59:40
                                 margin='normal'
                                 multiline
                                 rows="4"
-                                error={errors.status && touched.status}
+                                error={errors.status || touched.status}
                                 helperText={
                                     errors.status && touched.status ?

[Killed] ConditionalExpression
components/ui/forms/UpdateStatusForm.js:61:37
                                 rows="4"
                                 error={errors.status && touched.status}
                                 helperText={
-                                    errors.status && touched.status ?
+                                    true ?
                                         errors.status : ''
                                 }

[Survived] LogicalOperator
components/ui/forms/UpdateStatusForm.js:61:37
                                 rows="4"
                                 error={errors.status && touched.status}
                                 helperText={
-                                    errors.status && touched.status ?
+                                    errors.status || touched.status ?
                                         errors.status : ''
                                 }

[Killed] StringLiteral
components/ui/forms/UpdateStatusForm.js:66:44
                                 }
                             />
                             <FormHelperText
-                                component={'span'}
+                                component={""}
                                 error={true}
                             >
