[Survived] StringLiteral
components/ui/forms/UploadAvatarForm.js:21:17
             .required("Please select an image")
             .test(
                 "fileSize",
-                "Your image is too big :(",
+                "",
                 value => value.size <= 104857600
             )

[Survived] ArrowFunction
components/ui/forms/UploadAvatarForm.js:22:17
             .test(
                 "fileSize",
                 "Your image is too big :(",
-                value => value.size <= 104857600
+                () => undefined
             )
             .test(

[Survived] EqualityOperator
components/ui/forms/UploadAvatarForm.js:22:26
             .test(
                 "fileSize",
                 "Your image is too big :(",
-                value => value.size <= 104857600
+                value => value.size > 104857600
             )
             .test(

[Survived] LogicalOperator
components/ui/forms/UploadAvatarForm.js:27:26
             .test(
                 "fileType",
                 "png or jpeg only please",
-                value => value.type === 'image/jpeg' || value.type === 'image/png'
+                value => value.type === 'image/jpeg' && value.type === 'image/png'
             )
     })

[Survived] ConditionalExpression
components/ui/forms/UploadAvatarForm.js:27:57
             .test(
                 "fileType",
                 "png or jpeg only please",
-                value => value.type === 'image/jpeg' || value.type === 'image/png'
+                value => value.type === 'image/jpeg' || false
             )
     })

[Survived] BlockStatement
components/ui/forms/UploadAvatarForm.js:38:54
                 avatar: null,
             }}
             validationSchema={validationSchema}
-            onSubmit={(values, { setSubmitting }) => {
-                setSubmitting(true);
-                requests.post(
-                    `${process.env.REACT_APP_ENDPOINT}/account/updateavatar`,
-                    values
-                ).catch(err => {
-                    setSubmitError(err.message);
-                    setSubmitting(false);
-                })
-            }}
+            onSubmit={(values, { setSubmitting }) => {}}
 
             render={({

[Survived] StringLiteral
components/ui/forms/UploadAvatarForm.js:41:21
             onSubmit={(values, { setSubmitting }) => {
                 setSubmitting(true);
                 requests.post(
-                    `${process.env.REACT_APP_ENDPOINT}/account/updateavatar`,
+                    "",
                     values
                 ).catch(err => {

[Survived] BlockStatement
components/ui/forms/UploadAvatarForm.js:43:32
                 requests.post(
                     `${process.env.REACT_APP_ENDPOINT}/account/updateavatar`,
                     values
-                ).catch(err => {
-                    setSubmitError(err.message);
-                    setSubmitting(false);
-                })
+                ).catch(err => {})
             }}
 

[Killed] StringLiteral
components/ui/forms/UploadAvatarForm.js:70:55
                             title="Avatar"
                             setFieldValue={setFieldValue}
                             errorMessage={errors.marker_video ?
-                                errors.marker_video : ''
+                                errors.marker_video : "Stryker was here!"
                             }
                             touched={touched.marker_video}

[Survived] BooleanLiteral
components/ui/forms/UploadAvatarForm.js:81:59
                                 color="primary"
                                 component="button"
                                 type="submit"
-                                disabled={isSubmitting || !isValid}
+                                disabled={isSubmitting || isValid}
                             >
                                 Upload

[Survived] ConditionalExpression
components/ui/forms/UploadAvatarForm.js:81:43
                                 color="primary"
                                 component="button"
                                 type="submit"
-                                disabled={isSubmitting || !isValid}
+                                disabled={true}
                             >
                                 Upload

[Killed] StringLiteral
components/ui/forms/UploadAvatarForm.js:85:27
                             >
                                 Upload
                             </Button>
-                        : ''
+                        : "Stryker was here!"
                         }
                         {submitError ?
