[Survived] BlockStatement
components/ui/inputs/ImageInput.js:11:36
 const ImageInput = props => {
     const [fileName, setFileName] = useState('');
 
-    const handleVideoChange = e => {
-        e.preventDefault();
-        let reader = new FileReader();
-        let file = e.target.files[0];
-        if (file) {
-            reader.onloadend = () => setFileName(file.name);
-            reader.readAsDataURL(file);
-            props.setFieldValue(props.field.name, file);
-        }
-    }
+    const handleVideoChange = e => {}
 
     return (

[Survived] BlockStatement
components/ui/inputs/ImageInput.js:15:19
         e.preventDefault();
         let reader = new FileReader();
         let file = e.target.files[0];
-        if (file) {
-            reader.onloadend = () => setFileName(file.name);
-            reader.readAsDataURL(file);
-            props.setFieldValue(props.field.name, file);
-        }
+        if (file) {}
     }
 

[Survived] ConditionalExpression
components/ui/inputs/ImageInput.js:15:13
         e.preventDefault();
         let reader = new FileReader();
         let file = e.target.files[0];
-        if (file) {
+        if (true) {
             reader.onloadend = () => setFileName(file.name);
             reader.readAsDataURL(file);

[Survived] ArrowFunction
components/ui/inputs/ImageInput.js:16:32
         let reader = new FileReader();
         let file = e.target.files[0];
         if (file) {
-            reader.onloadend = () => setFileName(file.name);
+            reader.onloadend = () => undefined;
             reader.readAsDataURL(file);
             props.setFieldValue(props.field.name, file);

[Survived] BooleanLiteral
components/ui/inputs/ImageInput.js:47:70
                 </FormHelperText>
             ) : null}
             {props.errorMessage ? (
-                <FormHelperText id="image-upload-helper-text" error={true}>
+                <FormHelperText id="image-upload-helper-text" error={false}>
                     {props.errorMessage}
                 </FormHelperText>
