[Killed] StringLiteral
components/ui/inputs/VideoInput.js:9:46
 
 
 const VideoInput = props => {
-    const [fileName, setFileName] = useState('');
+    const [fileName, setFileName] = useState("Stryker was here!");
 
     const handleVideoChange = e => {

[Killed] ObjectLiteral
components/ui/inputs/VideoInput.js:25:24
     return (
         <FormControl margin='normal'>
             <input
-                style={{ display: "none" }}
+                style={{}}
                 id='video-upload'
                 name={props.field.name}

[Survived] BooleanLiteral
components/ui/inputs/VideoInput.js:48:70
                 </FormHelperText>
             ) : null}
             {props.errorMessage ? (
-                <FormHelperText id="video-upload-helper-text" error={true}>
+                <FormHelperText id="video-upload-helper-text" error={false}>
                     {props.errorMessage}
                 </FormHelperText>
