[Survived] BooleanLiteral
components/ui/modals/ErrorModal.js:10:48
 const ErrorModal = props => {
     // Prop: Error; string
 
-    const [openState, setOpenState] = useState(true)
+    const [openState, setOpenState] = useState(false)
 
     const useStyles = makeStyles(theme => ({

[Survived] ArrowFunction
components/ui/modals/ErrorModal.js:12:34
 
     const [openState, setOpenState] = useState(true)
 
-    const useStyles = makeStyles(theme => ({
-        modal: {
-            display: 'flex',
-            justifyContent: 'center',
-            alignItems: 'center',
-            marginTop: '-20vh',
-        },
-        content: {
-            display: 'flex',
-            flexDirection: 'column',
-            justifyContent: 'center',
-            alignItems: 'center',
-            width: '70%',
-            backgroundColor: theme.palette.background.paper,
-            border: '2px solid #000',
-            boxShadow: theme.shadows[5],
-            padding: theme.spacing(2, 4, 3),
-        },
-    }));
+    const useStyles = makeStyles(() => undefined);
 
     const classes = useStyles();

[Survived] StringLiteral
components/ui/modals/ErrorModal.js:14:22
 
     const useStyles = makeStyles(theme => ({
         modal: {
-            display: 'flex',
+            display: "",
             justifyContent: 'center',
             alignItems: 'center',

[Survived] StringLiteral
components/ui/modals/ErrorModal.js:20:22
             marginTop: '-20vh',
         },
         content: {
-            display: 'flex',
+            display: "",
             flexDirection: 'column',
             justifyContent: 'center',

[Survived] BooleanLiteral
components/ui/modals/ErrorModal.js:51:48
                     variant="contained"
                     color="primary"
                     component="span"
-                    onClick={e => setOpenState(false)}
+                    onClick={e => setOpenState(true)}
                 >
                     OK

[Survived] ArrowFunction
components/ui/modals/ErrorModal.js:51:30
                     variant="contained"
                     color="primary"
                     component="span"
-                    onClick={e => setOpenState(false)}
+                    onClick={() => undefined}
                 >
                     OK
