[Survived] ArrowFunction
components/ui/modals/SuccessModal.js:11:34
 const SuccessModal = props => {
     // Optional Prop: redirect; string
 
-    const useStyles = makeStyles(theme => ({
-        modal: {
-            display: 'flex',
-            justifyContent: 'center',
-            alignItems: 'center',
-            marginTop: '-20vh',
-        },
-        content: {
-            display: 'flex',
-            flexDirection: 'column',
-            justifyContent: 'center',
-            alignItems: 'center',
-            width: 400,
-            backgroundColor: theme.palette.background.paper,
-            border: '2px solid #000',
-            boxShadow: theme.shadows[5],
-            padding: theme.spacing(2, 4, 3),
-        },
-    }));
+    const useStyles = makeStyles(() => undefined);
 
     const classes = useStyles();

[Survived] BooleanLiteral
components/ui/modals/SuccessModal.js:37:19
             className={classes.modal}
             aria-labelledby="success modal"
             aria-describedby="whatever you did succeeded!"
-            open={true}
+            open={false}
         >
             <div className={classes.content}>
