[Killed] BlockStatement
components/ui/nav/BackButton.js:5:26
 import ArrowBackIcon from '@material-ui/icons/ArrowBack';
 import { makeStyles } from '@material-ui/core/styles';
 
-const BackButton = () => {
-
-    const useStyles = makeStyles({
-        root: {
-            //width: '100vw',
-            position: 'fixed',
-            top: 10,
-            left: 5,
-        },
-    });
-
-    const classes = useStyles();
-    return (
-        <ArrowBackIcon
-            className={classes.root}
-            onClick={() => window.history.back()}
-        />
-    )
-}
+const BackButton = () => {}
 
 export default BackButton;

[Survived] ObjectLiteral
components/ui/nav/BackButton.js:8:15
 const BackButton = () => {
 
     const useStyles = makeStyles({
-        root: {
-            //width: '100vw',
-            position: 'fixed',
-            top: 10,
-            left: 5,
-        },
+        root: {},
     });
 

[Survived] ArrowFunction
components/ui/nav/BackButton.js:20:22
     return (
         <ArrowBackIcon
             className={classes.root}
-            onClick={() => window.history.back()}
+            onClick={() => undefined}
         />
     )
