[Survived] BlockStatement
components/ui/nav/MainNav.js:27:44
     return (
         <BottomNavigation
             value={value}
-            onChange={(event, newValue) => {
-                setValue(newValue);
-            }}
+            onChange={(event, newValue) => {}}
             showLabels
             className={classes.root}
