[Survived] BooleanLiteral
sk8m8/src/screens/HomeScreen.js:20:52
 
 const HomeScreen = () => {
 
-    const [expanded, setExpanded] = React.useState(false);
+    const [expanded, setExpanded] = React.useState(true);
 
     const togglePanel = panel => (event, isExpanded) => {

[Survived] BlockStatement
sk8m8/src/screens/HomeScreen.js:22:57
 
     const [expanded, setExpanded] = React.useState(false);
 
-    const togglePanel = panel => (event, isExpanded) => {
-        setExpanded(isExpanded ? panel : false);
-    };
+    const togglePanel = panel => (event, isExpanded) => {};
 
     return (

[Survived] ArrowFunction
sk8m8/src/screens/HomeScreen.js:22:25
 
     const [expanded, setExpanded] = React.useState(false);
 
-    const togglePanel = panel => (event, isExpanded) => {
-        setExpanded(isExpanded ? panel : false);
-    };
+    const togglePanel = () => undefined;
 
     return (

[Survived] BooleanLiteral
sk8m8/src/screens/HomeScreen.js:23:42
     const [expanded, setExpanded] = React.useState(false);
 
     const togglePanel = panel => (event, isExpanded) => {
-        setExpanded(isExpanded ? panel : false);
+        setExpanded(isExpanded ? panel : true);
     };
 

[Killed] ConditionalExpression
sk8m8/src/screens/HomeScreen.js:37:27
             />
 
             <ExpansionPanel
-                expanded={expanded === 'emailPanel'}
+                expanded={true}
                 onChange={togglePanel('emailPanel')}
             >

[Killed] EqualityOperator
sk8m8/src/screens/HomeScreen.js:37:27
             />
 
             <ExpansionPanel
-                expanded={expanded === 'emailPanel'}
+                expanded={expanded !== 'emailPanel'}
                 onChange={togglePanel('emailPanel')}
             >

[Killed] ConditionalExpression
sk8m8/src/screens/HomeScreen.js:52:27
                 </ExpansionPanelDetails>
             </ExpansionPanel>
             <ExpansionPanel
-                expanded={expanded === 'passwordPanel'}
+                expanded={true}
                 onChange={togglePanel('passwordPanel')}
             >

[Killed] EqualityOperator
sk8m8/src/screens/HomeScreen.js:52:27
                 </ExpansionPanelDetails>
             </ExpansionPanel>
             <ExpansionPanel
-                expanded={expanded === 'passwordPanel'}
+                expanded={expanded !== 'passwordPanel'}
                 onChange={togglePanel('passwordPanel')}
             >
