[Survived] ArrayDeclaration
sk8m8/src/screens/MapScreen.js:20:46
 
 const MapScreen = () => {
     // Marker format TBD
-    const [location, setLocation] = useState([
-        null, null
-    ]);
+    const [location, setLocation] = useState([]);
     const [radius, setRadius] = useState(10);
     const [isLoading, setLoadingStatus] = useState(true);

[Killed] BooleanLiteral
sk8m8/src/screens/MapScreen.js:24:52
         null, null
     ]);
     const [radius, setRadius] = useState(10);
-    const [isLoading, setLoadingStatus] = useState(true);
+    const [isLoading, setLoadingStatus] = useState(false);
     const [showCreateMarkerForm, setShowCreateMarkerForm] = useState(false);
 

[Killed] BooleanLiteral
sk8m8/src/screens/MapScreen.js:25:70
     ]);
     const [radius, setRadius] = useState(10);
     const [isLoading, setLoadingStatus] = useState(true);
-    const [showCreateMarkerForm, setShowCreateMarkerForm] = useState(false);
+    const [showCreateMarkerForm, setShowCreateMarkerForm] = useState(true);
 
     useEffect(() => {

[Survived] BlockStatement
sk8m8/src/screens/MapScreen.js:27:21
     const [isLoading, setLoadingStatus] = useState(true);
     const [showCreateMarkerForm, setShowCreateMarkerForm] = useState(false);
 
-    useEffect(() => {
-        getLocation();
-    }, []);
+    useEffect(() => {}, []);
 
     const getLocation = async () => {

[Survived] BlockStatement
sk8m8/src/screens/MapScreen.js:31:37
         getLocation();
     }, []);
 
-    const getLocation = async () => {
-        const { latitude, longitude } = await locate()
-        setLocation([
-            latitude,
-            longitude
-        ]);
-        setLoadingStatus(false);
-    }
+    const getLocation = async () => {}
 
     const handleRadiusChange = val => {

[Survived] BooleanLiteral
sk8m8/src/screens/MapScreen.js:37:26
             latitude,
             longitude
         ]);
-        setLoadingStatus(false);
+        setLoadingStatus(true);
     }
 

[Survived] BlockStatement
sk8m8/src/screens/MapScreen.js:40:39
         setLoadingStatus(false);
     }
 
-    const handleRadiusChange = val => {
-        setRadius(val)
-    }
+    const handleRadiusChange = val => {}
 
     const toggleCreateMarkerForm = () => {

[Survived] BlockStatement
sk8m8/src/screens/MapScreen.js:44:42
         setRadius(val)
     }
 
-    const toggleCreateMarkerForm = () => {
-        setShowCreateMarkerForm(prev => !prev);
-    }
+    const toggleCreateMarkerForm = () => {}
 
     const formClasses = formStyles()

[Survived] ArrowFunction
sk8m8/src/screens/MapScreen.js:45:33
     }
 
     const toggleCreateMarkerForm = () => {
-        setShowCreateMarkerForm(prev => !prev);
+        setShowCreateMarkerForm(() => undefined);
     }
 

[Survived] BooleanLiteral
sk8m8/src/screens/MapScreen.js:45:41
     }
 
     const toggleCreateMarkerForm = () => {
-        setShowCreateMarkerForm(prev => !prev);
+        setShowCreateMarkerForm(prev => prev);
     }
 

[Survived] ArrowFunction
sk8m8/src/screens/MapScreen.js:78:35
                     <InputLabel htmlFor="radius">Radius</InputLabel>
                     <NativeSelect
                         value={radius}
-                        onChange={e => handleRadiusChange(e.target.value)}
+                        onChange={() => undefined}
                         inputProps={{ name: 'radius', id: 'radius' }}
                     >

[Killed] StringLiteral
sk8m8/src/screens/MapScreen.js:79:59
                     <NativeSelect
                         value={radius}
                         onChange={e => handleRadiusChange(e.target.value)}
-                        inputProps={{ name: 'radius', id: 'radius' }}
+                        inputProps={{ name: 'radius', id: "" }}
                     >
                         <option value={0}>0</option>
