[Survived] ArrayDeclaration
sk8m8/src/screens/PeopleScreen.js:8:46
 import PeopleListing from '../components/people/PeopleListing';
 
 const PeopleScreen = () => {
-    const [location, setLocation] = useState([
-        null, null
-    ]);
+    const [location, setLocation] = useState([]);
 
     const getLocation = async () => {

[Survived] BlockStatement
sk8m8/src/screens/PeopleScreen.js:12:37
         null, null
     ]);
 
-    const getLocation = async () => {
-        const { latitude, longitude } = await locate()
-        setLocation([
-            latitude,
-            longitude
-        ]);
-    }
+    const getLocation = async () => {}
 
     useEffect(() => {

[Survived] BlockStatement
sk8m8/src/screens/PeopleScreen.js:24:21
         getLocation();
     }, []);
 
-    useEffect(() => {
-        if (location[0] !== null && location[1] !== null) {
-            axios.post(
-                `${process.env.REACT_APP_ENDPOINT}/account/updatelocation`,
-                location
-            )
-        }
-    }, [location])
+    useEffect(() => {}, [location])
     
     return (

[Survived] EqualityOperator
sk8m8/src/screens/PeopleScreen.js:25:13
     }, []);
 
     useEffect(() => {
-        if (location[0] !== null && location[1] !== null) {
+        if (location[0] === null && location[1] !== null) {
             axios.post(
                 `${process.env.REACT_APP_ENDPOINT}/account/updatelocation`,

[Survived] EqualityOperator
sk8m8/src/screens/PeopleScreen.js:25:37
     }, []);
 
     useEffect(() => {
-        if (location[0] !== null && location[1] !== null) {
+        if (location[0] !== null && location[1] === null) {
             axios.post(
                 `${process.env.REACT_APP_ENDPOINT}/account/updatelocation`,
