[Survived] ConditionalExpression
sk8m8/sk8m8/src/serviceWorker.js:14:3
 // opt-in, read https://bit.ly/CRA-PWA
 
 const isLocalhost = Boolean(
-  window.location.hostname === 'localhost' ||
-    // [::1] is the IPv6 localhost address.
-    window.location.hostname === '[::1]' ||
-    // 127.0.0.1/8 is considered localhost for IPv4.
-    window.location.hostname.match(
-      /^127(?:\.(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)){3}$/
-    )
+  false
 );
 

[Survived] ConditionalExpression
sk8m8/sk8m8/src/serviceWorker.js:14:3
 // opt-in, read https://bit.ly/CRA-PWA
 
 const isLocalhost = Boolean(
-  window.location.hostname === 'localhost' ||
-    // [::1] is the IPv6 localhost address.
-    window.location.hostname === '[::1]' ||
+  false ||
     // 127.0.0.1/8 is considered localhost for IPv4.
     window.location.hostname.match(

[Survived] EqualityOperator
sk8m8/sk8m8/src/serviceWorker.js:16:5
 const isLocalhost = Boolean(
   window.location.hostname === 'localhost' ||
     // [::1] is the IPv6 localhost address.
-    window.location.hostname === '[::1]' ||
+    // [::1] is the IPv6 localhost address.
+window.location.hostname !== '[::1]' ||
     // 127.0.0.1/8 is considered localhost for IPv4.
     window.location.hostname.match(

[Survived] ConditionalExpression
sk8m8/sk8m8/src/serviceWorker.js:16:5
 const isLocalhost = Boolean(
   window.location.hostname === 'localhost' ||
     // [::1] is the IPv6 localhost address.
-    window.location.hostname === '[::1]' ||
+    true ||
     // 127.0.0.1/8 is considered localhost for IPv4.
     window.location.hostname.match(

[Survived] LogicalOperator
sk8m8/sk8m8/src/serviceWorker.js:24:7
 );
 
 export function register(config) {
-  if (process.env.NODE_ENV === 'production' && 'serviceWorker' in navigator) {
+  if (process.env.NODE_ENV === 'production' || 'serviceWorker' in navigator) {
     // The URL constructor is available in all browsers that support SW.
     const publicUrl = new URL(process.env.PUBLIC_URL, window.location.href);

[Survived] EqualityOperator
sk8m8/sk8m8/src/serviceWorker.js:24:7
 );
 
 export function register(config) {
-  if (process.env.NODE_ENV === 'production' && 'serviceWorker' in navigator) {
+  if (process.env.NODE_ENV !== 'production' && 'serviceWorker' in navigator) {
     // The URL constructor is available in all browsers that support SW.
     const publicUrl = new URL(process.env.PUBLIC_URL, window.location.href);

[Survived] ConditionalExpression
sk8m8/sk8m8/src/serviceWorker.js:27:9
   if (process.env.NODE_ENV === 'production' && 'serviceWorker' in navigator) {
     // The URL constructor is available in all browsers that support SW.
     const publicUrl = new URL(process.env.PUBLIC_URL, window.location.href);
-    if (publicUrl.origin !== window.location.origin) {
+    if (true) {
       // Our service worker won't work if PUBLIC_URL is on a different origin
       // from what our page is served on. This might happen if a CDN is used to

[Survived] ConditionalExpression
sk8m8/sk8m8/src/serviceWorker.js:27:9
   if (process.env.NODE_ENV === 'production' && 'serviceWorker' in navigator) {
     // The URL constructor is available in all browsers that support SW.
     const publicUrl = new URL(process.env.PUBLIC_URL, window.location.href);
-    if (publicUrl.origin !== window.location.origin) {
+    if (false) {
       // Our service worker won't work if PUBLIC_URL is on a different origin
       // from what our page is served on. This might happen if a CDN is used to

[Survived] BlockStatement
sk8m8/sk8m8/src/serviceWorker.js:34:43
       return;
     }
 
-    window.addEventListener('load', () => {
-      const swUrl = `${process.env.PUBLIC_URL}/service-worker.js`;
-
-      if (isLocalhost) {
-        // This is running on localhost. Let's check if a service worker still exists or not.
-        checkValidServiceWorker(swUrl, config);
-
-        // Add some additional logging to localhost, pointing developers to the
-        // service worker/PWA documentation.
-        navigator.serviceWorker.ready.then(() => {
-          console.log(
-            'This web app is being served cache-first by a service ' +
-              'worker. To learn more, visit https://bit.ly/CRA-PWA'
-          );
-        });
-      } else {
-        // Is not localhost. Just register service worker
-        registerValidSW(swUrl, config);
-      }
-    });
+    window.addEventListener('load', () => {});
   }
 }

[Survived] ConditionalExpression
sk8m8/sk8m8/src/serviceWorker.js:37:11
     window.addEventListener('load', () => {
       const swUrl = `${process.env.PUBLIC_URL}/service-worker.js`;
 
-      if (isLocalhost) {
+      if (false) {
         // This is running on localhost. Let's check if a service worker still exists or not.
         checkValidServiceWorker(swUrl, config);

[Survived] ConditionalExpression
sk8m8/sk8m8/src/serviceWorker.js:37:11
     window.addEventListener('load', () => {
       const swUrl = `${process.env.PUBLIC_URL}/service-worker.js`;
 
-      if (isLocalhost) {
+      if (true) {
         // This is running on localhost. Let's check if a service worker still exists or not.
         checkValidServiceWorker(swUrl, config);

[Survived] BlockStatement
sk8m8/sk8m8/src/serviceWorker.js:43:50
 
         // Add some additional logging to localhost, pointing developers to the
         // service worker/PWA documentation.
-        navigator.serviceWorker.ready.then(() => {
-          console.log(
-            'This web app is being served cache-first by a service ' +
-              'worker. To learn more, visit https://bit.ly/CRA-PWA'
-          );
-        });
+        navigator.serviceWorker.ready.then(() => {});
       } else {
         // Is not localhost. Just register service worker

[Survived] ArithmeticOperator
sk8m8/sk8m8/src/serviceWorker.js:45:13
         // service worker/PWA documentation.
         navigator.serviceWorker.ready.then(() => {
           console.log(
-            'This web app is being served cache-first by a service ' +
-              'worker. To learn more, visit https://bit.ly/CRA-PWA'
+            'This web app is being served cache-first by a service ' - 'worker. To learn more, visit https://bit.ly/CRA-PWA'
           );
         });

[Survived] StringLiteral
sk8m8/sk8m8/src/serviceWorker.js:45:13
         // service worker/PWA documentation.
         navigator.serviceWorker.ready.then(() => {
           console.log(
-            'This web app is being served cache-first by a service ' +
+            "" +
               'worker. To learn more, visit https://bit.ly/CRA-PWA'
           );

[Survived] BlockStatement
sk8m8/sk8m8/src/serviceWorker.js:49:14
               'worker. To learn more, visit https://bit.ly/CRA-PWA'
           );
         });
-      } else {
-        // Is not localhost. Just register service worker
-        registerValidSW(swUrl, config);
-      }
+      } else {}
     });
   }

[Survived] EqualityOperator
sk8m8/sk8m8/src/serviceWorker.js:63:13
     .then(registration => {
       registration.onupdatefound = () => {
         const installingWorker = registration.installing;
-        if (installingWorker == null) {
+        if (installingWorker != null) {
           return;
         }

[Survived] ConditionalExpression
sk8m8/sk8m8/src/serviceWorker.js:63:13
     .then(registration => {
       registration.onupdatefound = () => {
         const installingWorker = registration.installing;
-        if (installingWorker == null) {
+        if (true) {
           return;
         }

[Survived] ConditionalExpression
sk8m8/sk8m8/src/serviceWorker.js:67:15
           return;
         }
         installingWorker.onstatechange = () => {
-          if (installingWorker.state === 'installed') {
+          if (false) {
             if (navigator.serviceWorker.controller) {
               // At this point, the updated precached content has been fetched,

[Survived] ConditionalExpression
sk8m8/sk8m8/src/serviceWorker.js:67:15
           return;
         }
         installingWorker.onstatechange = () => {
-          if (installingWorker.state === 'installed') {
+          if (true) {
             if (navigator.serviceWorker.controller) {
               // At this point, the updated precached content has been fetched,

[Survived] ConditionalExpression
sk8m8/sk8m8/src/serviceWorker.js:68:17
         }
         installingWorker.onstatechange = () => {
           if (installingWorker.state === 'installed') {
-            if (navigator.serviceWorker.controller) {
+            if (true) {
               // At this point, the updated precached content has been fetched,
               // but the previous service worker will still serve the older

[Survived] BlockStatement
sk8m8/sk8m8/src/serviceWorker.js:68:53
         }
         installingWorker.onstatechange = () => {
           if (installingWorker.state === 'installed') {
-            if (navigator.serviceWorker.controller) {
-              // At this point, the updated precached content has been fetched,
-              // but the previous service worker will still serve the older
-              // content until all client tabs are closed.
-              console.log(
-                'New content is available and will be used when all ' +
-                  'tabs for this page are closed. See https://bit.ly/CRA-PWA.'
-              );
-
-              // Execute callback
-              if (config && config.onUpdate) {
-                config.onUpdate(registration);
-              }
-            } else {
+            if (navigator.serviceWorker.controller) {} else {
               // At this point, everything has been precached.
               // It's the perfect time to display a

[Survived] ArithmeticOperator
sk8m8/sk8m8/src/serviceWorker.js:73:17
               // but the previous service worker will still serve the older
               // content until all client tabs are closed.
               console.log(
-                'New content is available and will be used when all ' +
-                  'tabs for this page are closed. See https://bit.ly/CRA-PWA.'
+                'New content is available and will be used when all ' - 'tabs for this page are closed. See https://bit.ly/CRA-PWA.'
               );
 

[Survived] StringLiteral
sk8m8/sk8m8/src/serviceWorker.js:74:19
               // content until all client tabs are closed.
               console.log(
                 'New content is available and will be used when all ' +
-                  'tabs for this page are closed. See https://bit.ly/CRA-PWA.'
+                  ""
               );
 

[Survived] BlockStatement
sk8m8/sk8m8/src/serviceWorker.js:78:46
               );
 
               // Execute callback
-              if (config && config.onUpdate) {
-                config.onUpdate(registration);
-              }
+              if (config && config.onUpdate) {}
             } else {
               // At this point, everything has been precached.

[Survived] ConditionalExpression
sk8m8/sk8m8/src/serviceWorker.js:78:19
               );
 
               // Execute callback
-              if (config && config.onUpdate) {
+              if (true) {
                 config.onUpdate(registration);
               }

[Survived] BlockStatement
sk8m8/sk8m8/src/serviceWorker.js:81:20
               if (config && config.onUpdate) {
                 config.onUpdate(registration);
               }
-            } else {
-              // At this point, everything has been precached.
-              // It's the perfect time to display a
-              // "Content is cached for offline use." message.
-              console.log('Content is cached for offline use.');
-
-              // Execute callback
-              if (config && config.onSuccess) {
-                config.onSuccess(registration);
-              }
-            }
+            } else {}
           }
         };

[Survived] LogicalOperator
sk8m8/sk8m8/src/serviceWorker.js:88:19
               console.log('Content is cached for offline use.');
 
               // Execute callback
-              if (config && config.onSuccess) {
+              if (config || config.onSuccess) {
                 config.onSuccess(registration);
               }

[Survived] ConditionalExpression
sk8m8/sk8m8/src/serviceWorker.js:88:19
               console.log('Content is cached for offline use.');
 
               // Execute callback
-              if (config && config.onSuccess) {
+              if (false) {
                 config.onSuccess(registration);
               }

[Survived] BlockStatement
sk8m8/sk8m8/src/serviceWorker.js:96:21
         };
       };
     })
-    .catch(error => {
-      console.error('Error during service worker registration:', error);
-    });
+    .catch(error => {});
 }
 

[Survived] BlockStatement
sk8m8/sk8m8/src/serviceWorker.js:104:23
 function checkValidServiceWorker(swUrl, config) {
   // Check if the service worker can be found. If it can't reload the page.
   fetch(swUrl)
-    .then(response => {
-      // Ensure service worker exists, and that we really are getting a JS file.
-      const contentType = response.headers.get('content-type');
-      if (
-        response.status === 404 ||
-        (contentType != null && contentType.indexOf('javascript') === -1)
-      ) {
-        // No service worker found. Probably a different app. Reload the page.
-        navigator.serviceWorker.ready.then(registration => {
-          registration.unregister().then(() => {
-            window.location.reload();
-          });
-        });
-      } else {
-        // Service worker found. Proceed as normal.
-        registerValidSW(swUrl, config);
-      }
-    })
+    .then(response => {})
     .catch(() => {
       console.log(

[Survived] ConditionalExpression
sk8m8/sk8m8/src/serviceWorker.js:108:9
       // Ensure service worker exists, and that we really are getting a JS file.
       const contentType = response.headers.get('content-type');
       if (
-        response.status === 404 ||
-        (contentType != null && contentType.indexOf('javascript') === -1)
+        false
       ) {
         // No service worker found. Probably a different app. Reload the page.

[Survived] ConditionalExpression
sk8m8/sk8m8/src/serviceWorker.js:108:9
       // Ensure service worker exists, and that we really are getting a JS file.
       const contentType = response.headers.get('content-type');
       if (
-        response.status === 404 ||
+        false ||
         (contentType != null && contentType.indexOf('javascript') === -1)
       ) {

[Survived] LogicalOperator
sk8m8/sk8m8/src/serviceWorker.js:109:10
       const contentType = response.headers.get('content-type');
       if (
         response.status === 404 ||
-        (contentType != null && contentType.indexOf('javascript') === -1)
+        (contentType != null || contentType.indexOf('javascript') === -1)
       ) {
         // No service worker found. Probably a different app. Reload the page.

[Survived] ConditionalExpression
sk8m8/sk8m8/src/serviceWorker.js:109:33
       const contentType = response.headers.get('content-type');
       if (
         response.status === 404 ||
-        (contentType != null && contentType.indexOf('javascript') === -1)
+        (contentType != null && true)
       ) {
         // No service worker found. Probably a different app. Reload the page.

[Survived] BlockStatement
sk8m8/sk8m8/src/serviceWorker.js:110:9
       if (
         response.status === 404 ||
         (contentType != null && contentType.indexOf('javascript') === -1)
-      ) {
-        // No service worker found. Probably a different app. Reload the page.
-        navigator.serviceWorker.ready.then(registration => {
-          registration.unregister().then(() => {
-            window.location.reload();
-          });
-        });
-      } else {
+      ) {} else {
         // Service worker found. Proceed as normal.
         registerValidSW(swUrl, config);

[Survived] BlockStatement
sk8m8/sk8m8/src/serviceWorker.js:112:60
         (contentType != null && contentType.indexOf('javascript') === -1)
       ) {
         // No service worker found. Probably a different app. Reload the page.
-        navigator.serviceWorker.ready.then(registration => {
-          registration.unregister().then(() => {
-            window.location.reload();
-          });
-        });
+        navigator.serviceWorker.ready.then(registration => {});
       } else {
         // Service worker found. Proceed as normal.

[Survived] BlockStatement
sk8m8/sk8m8/src/serviceWorker.js:113:48
       ) {
         // No service worker found. Probably a different app. Reload the page.
         navigator.serviceWorker.ready.then(registration => {
-          registration.unregister().then(() => {
-            window.location.reload();
-          });
+          registration.unregister().then(() => {});
         });
       } else {

[Survived] BlockStatement
sk8m8/sk8m8/src/serviceWorker.js:117:14
             window.location.reload();
           });
         });
-      } else {
-        // Service worker found. Proceed as normal.
-        registerValidSW(swUrl, config);
-      }
+      } else {}
     })
     .catch(() => {

[Survived] BlockStatement
sk8m8/sk8m8/src/serviceWorker.js:122:18
         registerValidSW(swUrl, config);
       }
     })
-    .catch(() => {
-      console.log(
-        'No internet connection found. App is running in offline mode.'
-      );
-    });
+    .catch(() => {});
 }
 

[Survived] BlockStatement
sk8m8/sk8m8/src/serviceWorker.js:129:30
     });
 }
 
-export function unregister() {
-  if ('serviceWorker' in navigator) {
-    navigator.serviceWorker.ready.then(registration => {
-      registration.unregister();
-    });
-  }
-}
+export function unregister() {}
 

[Survived] ConditionalExpression
sk8m8/sk8m8/src/serviceWorker.js:130:7
 }
 
 export function unregister() {
-  if ('serviceWorker' in navigator) {
+  if (true) {
     navigator.serviceWorker.ready.then(registration => {
       registration.unregister();

[Survived] ConditionalExpression
sk8m8/sk8m8/src/serviceWorker.js:130:7
 }
 
 export function unregister() {
-  if ('serviceWorker' in navigator) {
+  if (false) {
     navigator.serviceWorker.ready.then(registration => {
       registration.unregister();

[Survived] BlockStatement
sk8m8/sk8m8/src/serviceWorker.js:131:56
 
 export function unregister() {
   if ('serviceWorker' in navigator) {
-    navigator.serviceWorker.ready.then(registration => {
-      registration.unregister();
-    });
+    navigator.serviceWorker.ready.then(registration => {});
   }
 }
