[Killed] BlockStatement
sk8m8/src/screens/SignupScreen.js:9:28
 
 const axios = require('axios');
 
-const SignupScreen = () => {
-
-    return (
-        <div className={'form-screen'}>
-            <BackButton />
-            <h1>S K 8 M 8</h1>
-            <SignupForm requests={axios} />
-            <div style={{marginBottom: 100}}></div>
-        </div>
-    );
-}
+const SignupScreen = () => {}
 
 export default SignupScreen
