[Survived] StringLiteral
sk8m8/src/styles/forms.js:8:21
         display: 'flex',
         flexDirection: 'column',
         justifyContent: 'center',
-        alignItems: 'center',
+        alignItems: "",
         maxWidth: 225,
         padding: 20,

[Survived] ObjectLiteral
sk8m8/src/styles/forms.js:16:20
         display: 'flex',
         justifyContent: 'space-between',
     },
-    textFieldForm: {
-        display: 'flex',
-        flexDirection: 'column',
-        justifyContent: 'right'
-    },
+    textFieldForm: {},
     inputField: {
         margin: theme.spacing(2),

[Survived] StringLiteral
sk8m8/src/styles/forms.js:17:18
         justifyContent: 'space-between',
     },
     textFieldForm: {
-        display: 'flex',
+        display: "",
         flexDirection: 'column',
         justifyContent: 'right'

[Survived] ObjectLiteral
sk8m8/src/styles/forms.js:21:17
         flexDirection: 'column',
         justifyContent: 'right'
     },
-    inputField: {
-        margin: theme.spacing(2),
-        width: 225,
-    },
+    inputField: {},
     submit: {
         margin: theme.spacing(2),

[Survived] StringLiteral
sk8m8/src/styles/forms.js:29:20
         margin: theme.spacing(2),
     },
     inlineFormSubmit:{
-        marginTop: 'auto',
+        marginTop: "",
         maxHeight: 35
     },

[Survived] ObjectLiteral
sk8m8/src/styles/forms.js:32:16
         marginTop: 'auto',
         maxHeight: 35
     },
-    pullRight: {
-        marginLeft: 'auto',
-    },
+    pullRight: {},
     standardSpacing: {
         margin: theme.spacing(2)

[Survived] StringLiteral
sk8m8/src/styles/forms.js:39:26
         margin: theme.spacing(2)
     },
     embeddedFormHeader: {
-        backgroundColor: '#30363a',
+        backgroundColor: "",
         color: 'white',
         width: '100%',

[Survived] StringLiteral
sk8m8/src/styles/forms.js:41:16
     embeddedFormHeader: {
         backgroundColor: '#30363a',
         color: 'white',
-        width: '100%',
+        width: "",
         height: 'auto',
         marginTop: 0,
