[Killed] BlockStatement
src/utils/browser/getCookie.js:1:30
-const getCookie = (cname) => {
-    var name = cname + "=";
-    var decodedCookie = decodeURIComponent(document.cookie);
-    var ca = decodedCookie.split(';');
-    for (var i = 0; i < ca.length; i++) {
-        var c = ca[i];
-        while (c.charAt(0) === ' ') {
-            c = c.substring(1);
-        }
-        if (c.indexOf(name) === 0) {
-            return c.substring(name.length, c.length);
-        }
-    }
-    return "";
-}
+const getCookie = (cname) => {}
 
 export default getCookie

[Killed] ArithmeticOperator
src/utils/browser/getCookie.js:2:16
 const getCookie = (cname) => {
-    var name = cname + "=";
+    var name = cname - "=";
     var decodedCookie = decodeURIComponent(document.cookie);
     var ca = decodedCookie.split(';');

[Killed] StringLiteral
src/utils/browser/getCookie.js:4:34
 const getCookie = (cname) => {
     var name = cname + "=";
     var decodedCookie = decodeURIComponent(document.cookie);
-    var ca = decodedCookie.split(';');
+    var ca = decodedCookie.split("");
     for (var i = 0; i < ca.length; i++) {
         var c = ca[i];

[Killed] ConditionalExpression
src/utils/browser/getCookie.js:5:21
     var name = cname + "=";
     var decodedCookie = decodeURIComponent(document.cookie);
     var ca = decodedCookie.split(';');
-    for (var i = 0; i < ca.length; i++) {
+    for (var i = 0; false; i++) {
         var c = ca[i];
         while (c.charAt(0) === ' ') {

[Killed] EqualityOperator
src/utils/browser/getCookie.js:5:21
     var name = cname + "=";
     var decodedCookie = decodeURIComponent(document.cookie);
     var ca = decodedCookie.split(';');
-    for (var i = 0; i < ca.length; i++) {
+    for (var i = 0; i >= ca.length; i++) {
         var c = ca[i];
         while (c.charAt(0) === ' ') {

[Survived] ConditionalExpression
src/utils/browser/getCookie.js:7:16
     var ca = decodedCookie.split(';');
     for (var i = 0; i < ca.length; i++) {
         var c = ca[i];
-        while (c.charAt(0) === ' ') {
+        while (false) {
             c = c.substring(1);
         }

[Timeout] EqualityOperator
src/utils/browser/getCookie.js:7:16
     var ca = decodedCookie.split(';');
     for (var i = 0; i < ca.length; i++) {
         var c = ca[i];
-        while (c.charAt(0) === ' ') {
+        while (c.charAt(0) !== ' ') {
             c = c.substring(1);
         }

[Killed] ConditionalExpression
src/utils/browser/getCookie.js:10:13
         while (c.charAt(0) === ' ') {
             c = c.substring(1);
         }
-        if (c.indexOf(name) === 0) {
+        if (true) {
             return c.substring(name.length, c.length);
         }

[Killed] EqualityOperator
src/utils/browser/getCookie.js:10:13
         while (c.charAt(0) === ' ') {
             c = c.substring(1);
         }
-        if (c.indexOf(name) === 0) {
+        if (c.indexOf(name) !== 0) {
             return c.substring(name.length, c.length);
         }
