[Survived] ArrowFunction
src/utils/__mocks__/mockAxios.js:2:18
 export default {
-    get: jest.fn(() => Promise.resolve({ data: {} }))
+    get: jest.fn(() => undefined)
 };

[Survived] ObjectLiteral
src/utils/__mocks__/mockAxios.js:2:40
 export default {
-    get: jest.fn(() => Promise.resolve({ data: {} }))
+    get: jest.fn(() => Promise.resolve({}))
 };
