[Survived] BlockStatement
src/utils/browser/locate.js:1:35
-const _getCurrentPosition = () => {
-    return new Promise((resolve, reject) => {
-        navigator.geolocation.getCurrentPosition(resolve, reject);
-    });
-}
+const _getCurrentPosition = () => {}
 
 const locate = async () => {

[Survived] BlockStatement
src/utils/browser/locate.js:2:45
 const _getCurrentPosition = () => {
-    return new Promise((resolve, reject) => {
-        navigator.geolocation.getCurrentPosition(resolve, reject);
-    });
+    return new Promise((resolve, reject) => {});
 }
 

[Survived] BlockStatement
src/utils/browser/locate.js:7:28
     });
 }
 
-const locate = async () => {
-    let latitude = null,
-        longitude = null;
-    if (navigator.geolocation) {
-        try {
-            const myPosition = await _getCurrentPosition();
-            latitude = myPosition.coords.latitude;
-            longitude = myPosition.coords.longitude;
-        } catch (e) {
-            console.log(e)
-        }
-    }
-    //console.log(latitude, longitude)
-    return { latitude, longitude };
-}
+const locate = async () => {}
 
 export default locate

[Survived] ConditionalExpression
src/utils/browser/locate.js:10:9
 const locate = async () => {
     let latitude = null,
         longitude = null;
-    if (navigator.geolocation) {
+    if (true) {
         try {
             const myPosition = await _getCurrentPosition();

[Survived] BlockStatement
src/utils/browser/locate.js:10:32
 const locate = async () => {
     let latitude = null,
         longitude = null;
-    if (navigator.geolocation) {
-        try {
-            const myPosition = await _getCurrentPosition();
-            latitude = myPosition.coords.latitude;
-            longitude = myPosition.coords.longitude;
-        } catch (e) {
-            console.log(e)
-        }
-    }
+    if (navigator.geolocation) {}
     //console.log(latitude, longitude)
     return { latitude, longitude };

[Survived] BlockStatement
src/utils/browser/locate.js:11:13
     let latitude = null,
         longitude = null;
     if (navigator.geolocation) {
-        try {
-            const myPosition = await _getCurrentPosition();
-            latitude = myPosition.coords.latitude;
-            longitude = myPosition.coords.longitude;
-        } catch (e) {
+        try {} catch (e) {
             console.log(e)
         }

[Survived] BlockStatement
src/utils/browser/locate.js:15:21
             const myPosition = await _getCurrentPosition();
             latitude = myPosition.coords.latitude;
             longitude = myPosition.coords.longitude;
-        } catch (e) {
-            console.log(e)
-        }
+        } catch (e) {}
     }
     //console.log(latitude, longitude)
