[Survived] BlockStatement
src/utils/fetch/queryUrlBuilder.js:2:67
 
-const queryUrlBuilder = (endpoint, controller, action, params) => {
-    let queryParams
-    params ? queryParams = new URLSearchParams(params).toString() : '';
-    return `${endpoint}/${controller}/${action}/${queryParams}`
-};
+const queryUrlBuilder = (endpoint, controller, action, params) => {};
 
 export default queryUrlBuilder;

[Survived] StringLiteral
src/utils/fetch/queryUrlBuilder.js:5:12
 const queryUrlBuilder = (endpoint, controller, action, params) => {
     let queryParams
     params ? queryParams = new URLSearchParams(params).toString() : '';
-    return `${endpoint}/${controller}/${action}/${queryParams}`
+    return ""
 };
 
