[Survived] BlockStatement
src/utils/hooks/useLocalStorage.js:3:44
 import React from 'react';
 
-const useLocalStorage = localStorageKey => {
-    // param: what we're calling the data; string
-
-    const [value, setValue] = React.useState(
-        localStorage.getItem(localStorageKey)
-    );
-
-    React.useEffect(() => {
-        localStorage.setItem(localStorageKey, value);
-    }, [value]);
-
-    return [value, setValue];
-};
+const useLocalStorage = localStorageKey => {};
 
 export default useLocalStorage;

[Survived] BlockStatement
src/utils/hooks/useLocalStorage.js:10:27
         localStorage.getItem(localStorageKey)
     );
 
-    React.useEffect(() => {
-        localStorage.setItem(localStorageKey, value);
-    }, [value]);
+    React.useEffect(() => {}, [value]);
 
     return [value, setValue];
