[Survived] BlockStatement
src/utils/hooks/useSessionStorage.js:3:48
 import React from 'react';
 
-const useSessionStorage = sessionStorageKey => {
-    // param: what we're calling the data; string
-
-    const [value, setValue] = React.useState(
-        sessionStorage.getItem(sessionStorageKey)
-    );
-
-    React.useEffect(() => {
-        sessionStorage.setItem(sessionStorageKey, value);
-    }, [value]);
-
-    return [value, setValue];
-};
+const useSessionStorage = sessionStorageKey => {};
 
 export default useSessionStorage;

[Survived] BlockStatement
src/utils/hooks/useSessionStorage.js:10:27
         sessionStorage.getItem(sessionStorageKey)
     );
 
-    React.useEffect(() => {
-        sessionStorage.setItem(sessionStorageKey, value);
-    }, [value]);
+    React.useEffect(() => {}, [value]);
 
     return [value, setValue];

[Survived] ArrayDeclaration
src/utils/hooks/useSessionStorage.js:12:8
 
     React.useEffect(() => {
         sessionStorage.setItem(sessionStorageKey, value);
-    }, [value]);
+    }, []);
 
     return [value, setValue];

[Survived] ArrayDeclaration
src/utils/hooks/useSessionStorage.js:14:12
         sessionStorage.setItem(sessionStorageKey, value);
     }, [value]);
 
-    return [value, setValue];
+    return [];
 };
 
