[Killed] BlockStatement
src/utils/browser/slowNetwork.js:1:27
-const slowNetwork = () => {
-    let slow = null
-    if (window.NetworkInformation) {
-        slow = NetworkInformation.downlink < 500
-    }
-    return slow
-}
+const slowNetwork = () => {}
 
 export default slowNetwork;

[Killed] ConditionalExpression
src/utils/browser/slowNetwork.js:3:9
 const slowNetwork = () => {
     let slow = null
-    if (window.NetworkInformation) {
+    if (false) {
         slow = NetworkInformation.downlink < 500
     }

[Killed] BlockStatement
src/utils/browser/slowNetwork.js:3:36
 const slowNetwork = () => {
     let slow = null
-    if (window.NetworkInformation) {
-        slow = NetworkInformation.downlink < 500
-    }
+    if (window.NetworkInformation) {}
     return slow
 }

[Killed] ConditionalExpression
src/utils/browser/slowNetwork.js:4:16
 const slowNetwork = () => {
     let slow = null
     if (window.NetworkInformation) {
-        slow = NetworkInformation.downlink < 500
+        slow = false
     }
     return slow

[Killed] ConditionalExpression
src/utils/browser/slowNetwork.js:4:16
 const slowNetwork = () => {
     let slow = null
     if (window.NetworkInformation) {
-        slow = NetworkInformation.downlink < 500
+        slow = true
     }
     return slow
