[Survived] BlockStatement
src/utils/map/fetchMarkerDetails.js:4:46
 // DEV ONLY
 import markerDetailJson from '../dummyData/marker_detail.json';
 
-const fetchMarkerDetails = async markerId => {
-    let markerDetails = await markerDetailJson.data
-
-    return markerDetails
-}
+const fetchMarkerDetails = async markerId => {}
 
 export default fetchMarkerDetails;
