[Survived] BlockStatement
src/utils/map/fetchLocationTypes.js:4:40
 // DEV ONLY
 import locationTypesJson from '../dummyData/location_types.json';
 
-const fetchLocationTypes = async () => {
-    let locationTypes = await locationTypesJson.data;
-
-    return locationTypes
-}
+const fetchLocationTypes = async () => {}
 
 export default fetchLocationTypes;
