[Survived] BlockStatement
src/utils/map/setMarkerIcons.js:5:30
 import icon from 'leaflet/dist/images/marker-icon.png';
 import iconShadow from 'leaflet/dist/images/marker-shadow.png';
 
-const setMarkerIcons = () => {
-    let DefaultIcon = L.icon({
-        iconUrl: icon,
-        shadowUrl: iconShadow,
-    });
-    L.Marker.prototype.options.icon = DefaultIcon;
-}
+const setMarkerIcons = () => {}
 
 export default setMarkerIcons;
